[{"itemid": "MI76-50CALML-1", "subcat": ".50 Cal Molon Labe T-Shirt", "name": ".50 Cal Molon Labe T-Shirt", "img": ["50calmolonlabet-shirt_f__2.jpg", "50calmolonshirt_backsleeve_1.jpg", "50calmolonsleeve_1.jpg"], "price": "$103.60", "desc": " Molon Labe - Come and Take ItThis might just be our best Molon Labe shirt yet.  Alex Jones personally collaborated with our top designers to create the .50 Cal Molon Labe Infowars T-shirt design.  This Infowars 1776 design features two .50 caliber bullets crossed in front of a Spartan helmet.  Molon Labe is written in classic Greek script across the top with an American flag in the background.  The back features an Infowars logo just below the neckline.  As an added bonus, there is a smaller special forces style American flag on the left sleeve.       The .50 Cal Molon Labe Infowars T-shirt is part of the Made In 1776 line of American made products.  Printed on a high quality, Made in the USA, 100% cotton t-shirt.  Made In 1776--Premium Patriot Apparel:  Celebrate the spirit of freedom and liberty upon which our nation was founded.  Made in 1776 is dedicated to bringing you distinctive patriotic designs on the highest quality apparel that is proudly Made In America.  Join the revolution, your purchase not only supports the Infowar, it supports America.   "}, {"itemid": "SP-IWL-LIVOXY-1", "subcat": "Advanced Liver Cleanse Pack", "name": "Advanced Liver Cleanse Pack", "img": ["new-alc-thumbnail.jpg", "oxypowder120_label_4_1.jpg", "livershield_label_1.jpg"], "price": "$103.60", "desc": " \r\n\tdiv#a2751f3 .center {\r\n\t\twidth: 100%;\r\n\t\ttext-align: center;\r\n\t}\r\n\tdiv#a2751f3 table {\r\n\t\tfont-size: 10pt;\r\n\t\tcolor: #000;\r\n\t}\r\n\n\n\n\nDr. Group's 6 Day Liver Cleanse Instructions\nYou should be able to perform this liver cleanse while still working or carrying on your normal daily activities. It is best to begin the liver cleanse on a Tuesday or Wednesday so that on Day 5 (Saturday or Sunday) you will be at home in a relaxed setting and near a bathroom.\nSupplies Needed for The Liver Cleanse\n\nThe Liver Cleanse Kit (1 Liver Shield, 1 Oxy-Powder)\n1 bottle (16 ounces) of Organic Raw Apple Cider Vinegar (ACV)\n3 gallons of distilled (recommended), or filtered/purified drinking water\n1 tablespoon of USP Epsom Salt\n6 oz. of Organic Cold Pressed Extra Virgin Olive Oil\nThe recommended organic fruits, vegetables, and snacks for the diet as listed below:\n\nFollowing the diet will give you optimal results but if you feel that you're unable to follow the diet, at least try to limit your meat intake to one portion every other day for lunch. Eat fish or chicken, avoid red meat, and incorporate healthy diet choices.\nIngredients for Days 1-4\n\n\n\nBreakfast:You will bechoosing ONE of the following liver cleansing fruits to eat or juice as much as you like. If you can't find fresh fruits, substitute with organic frozen fruit.\nLunch & Dinner:You will be using the following liver cleansing vegetables to make a homemade vegetable soup, juice, or salad.\nSnacks:In between meals, you will be eating a handful of the following raw nuts and seeds:\n\n\n\n\nWatermelon\nPapaya\nKiwi\nPlums\nPears\nApples\nCherries\nFigs\nGrapefruit\n\n\n\n\nArtichoke\nAsparagus\nAvocado\nCarrots\nBeets\nBroccoli\nCabbage (green, purple or both)\nKale\nBrussel Sprouts\nGarlic\nSpinach\nRomaine lettuce\nSalad greens\nOnions\nCauliflower\n\n\n\n\nSunflower seeds\nPumpkin seeds\nWalnuts\nBrazil nuts\nAlmonds\n\n\n\n\n\nIngredients for Day 5 - Flush Day\n\n\n\nBreakfast\nYou will be choosing ONE of the following liver cleansing fruits to eat or juice.\n\n\n\n\n\nWatermelon (recommended due to its high glutathione content)\nPapaya\nKiwi\nPlums\nPears\nApples\nCherries\nFigs\nGrapefruit\n\n\n\n\nLunch\nOption #1 - Liver Cleanse Soup\nOption #2 - Beet/Carrot Juice\n\n\n\n\n\n1 Organic Beet\n2 Organic Carrots\n1 Cup Broccoli\n10 Organic Garlic Cloves\n½ Organic Onion\n¼ Organic Lemon\n2 Bay Leaves\n1 Teaspoon Himalayan Crystal Salt\n½ Teaspoon Organic Turmeric\n½ Teaspoon Organic Oregano\n\n\n\n\n3 Organic Carrots\n1 Organic Beet\n2 Organic Red Apples\n6 Organic Kale Leaves\n½ Organic Lemon\n½ inch Ginger Root\n\nOption #3\n\nWater/ACV Mixture\n\n\n\n\nMid-Afternoon\nOption #1\nOption #2\n\n\nSnack\n\n\n\n\n\nOrganic Avocados\nOrganic Lime or Lemon\nHimalayan Crystal Salt\n\n\n\n\n6-8 ounces of raw organic walnuts\n\nOption #3\n\nWater/ACV Mixture\n\n\n\n\n\nDietary Considerations During Your Liver Cleanse\nTo get the most out of your liver cleanse, it's necessary to follow a healthy diet to support your liver and colon. Try to incorporate the following dietary guidelines to reduce your toxin exposure while cleansing.\n\nTry to purchase organic or locally grown foods as conventional foods are often over-processed, sprayed with pesticides, or grown in nutrient depleted soil.\nTry to include healthy oils in your diet such as coconut, hemp, flax seed, or olive.\nAvoid cow's milk and cheese during the cleanse, instead try almond or hemp milk.\nAvoid foods that contain gluten, such as cereal grains, wheat, barley, white flour, pasta, bread, couscous, flour, tortillas, cakes, crackers, cookies, pastries, chips, imitation fish, hot dogs, and fried foods.\nAvoid alcoholic beverages.\nAvoid diet sodas and other products often contain artificial sweeteners such as saccharin, aspartame, neotame, acesulfame potassium, and sucralose. Substitute with natural sweeteners such as honey, stevia, or coconut sugar.\nAvoid foods that contain high fructose corn syrup, corn syrup, molasses, white sugar, dextrose, sorbitol, processed fructose, and sucrose.\nReplace table salt (sodium chloride) with himalayan salt.\nAvoid soy products. Most soy contains pesticide residue and is genetically modified. Soybeans are also high in phytic acid which is damaging to the digestive tract and blocks the absorption of nutrients and essential minerals.\nCaffeine, in moderation, is acceptable during your cleanse. Try organic tea or coffee without creamers and use natural sweeteners such as raw honey.\n\nWhat To Expect During Your Liver Cleanse\nOxy-Powder can cause watery stools, so make sure a bathroom is nearby. If your stools are liquid, remember this is not diarrhea but the result of turning solid compacted fecal matter in the intestinal tract into a liquid or gas.\nA small percentage of people may experience what is known as a healing crisis. You may feel worse during and after your liver cleanse than you did before you started it. The accumulation of toxic material must be processed to be removed from the body. Don't get discouraged.\nBefore You Start: Prepare Your Liver Cleanse Formula\nThe night before you start your cleanse, make the following 2 gallons and try to go to bed before 9pm to get a good night's rest.\nHow to Make the Liver Shield Liver Cleanse Formula\n\nMaking Gallon #1: Liver Shield Liver Cleanse Formula: Pour out 3 ounces from your 1st gallon of distilled or purified water and add all of the Liver Shield formula and 2 tablespoons of Organic Raw Apple Cider Vinegar (ACV). Shake and refrigerate.\nMaking Gallon #2: Water/Apple Cider Vinegar Mixture (ACV): Pour out 2 ounces from your 2nd gallon of distilled or purified drinking water and add 1 ounce of Organic Raw Apple Cider Vinegar. Shake and refrigerate.\n\nDay 1 - Start Your Liver Cleanse\n\n8:00am: Eat a healthy Breakfast Option (see breakfast diet options from day 1-4). Do not mix the fruits!\n9:00am: Drink one 8-ounce glass of Liver Shield Liver Cleanse Formula.\n10:00-11:00am: Water and Snack (optional). Drink 12 ounces of your Water/ACV Mixture.\n12:00pm: Drink one 8-ounce glass of the Liver Shield Liver Cleanse Formula.\n1:00pm: Eat healthy Lunch Meal (see lunch diet options from day 1-4). Drink only the Water/ACV Mixture with your lunch meal.\n3:00pm: Drink one 8-ounce glass of the Liver Shield Liver Cleanse Formula.\n4:00-5:00pm: Water and Snack (optional). Drink 12 ounces of your Water/ACV Mixture.\n6:00pm: Drink one 8-ounce glass of the Liver Shield Liver Cleanse Formula.\n7:00pm: Eat healthy Dinner Meal (see dinner diet options from day 1-4). Drink only the Water/ACV Mixture with your dinner meal.\n8:00-10:00pm: Before bed, take 4 capsules of Oxy-Powder. Do not go to bed past 10pm!\n\nDays Two, Three, and Four of Your Liver Cleanse\nFollow the same instructions as Day 1, however, from 8:00-10:00pm: take 6 capsules of Oxy-Powder.\nDay 5 of Your Liver Cleanse - Flush Day\u009d\n8:00am to 10:00am - Breakfast Meal (see breakfast diet options for day 5). Do not mix the fruits! We recommend using watermelon if it is available due to its high glutathione content.\nAfter breakfast, start preparing your Liver Cleanse Soup for lunch (see the recipe below) if you choose Option #1. Drink the Water/ACV Mixture as needed until lunch.\n12:00pm - Liver Supporting Lunch Meal. Choose from one of the following 3 options for your lunch meal:\nOption #1 - Liver Cleanse Soup (Recommended)\nTo maximize the liver's ability to detox and cleanse, choose a combination of foods which are high in naturally occurring sulphur and glutathione. Sulphur helps the liver cleanse harmful chemicals.\nThe ingredients in the liver cleanse soup include the following:\n\n1 Organic Beet (Washed and Chopped)\n2 Organic Carrots (Chopped)\n1 Cup Broccoli (Chopped)\n10 Organic Garlic Cloves (Minced)\n½ Organic Onion (Chopped)\n¼ Organic Lemon\n2 Bay Leaves\n1 Teaspoon Himalayan Crystal Salt\n½ Teaspoon Organic Turmeric\n½ Teaspoon Organic Oregano\nOther liver cleansing foods you can use:artichoke, asparagus, cabbage, kale, brussel sprouts, and cauliflower can be added to the soup.\n\nTo prepare the Liver Cleanse Soup: Wash vegetables. Finely chop ingredients to desired consistency. Pour 32 ounces of distilled or purified water into a soup pot. Add all of the ingredients to the water. Bring to a boil, reduce heat, and then simmer on low heat for one hour. Eat this soup for your lunch meal. After your meal, refrigerate the remaining portion of your soup for tomorrow's lunch meal (Day 6).\nOption #2 - Beet/Carrot Juice (Alternate):\n\nPeel and juice ingredients in a blender until desired consistency is achieved.\n3 Organic Carrots (washed and peeled)\n1 Organic Beet (washed and peeled)\n2 Organic Red Apples (washed and cut)\n6 Organic Kale Leaves\n½ Organic Lemon (washed and peeled)\n½ inch Ginger Root\n\nOption 3: (Water/ACV Mixture) - If you are not hungry or you feel that you can fast through lunch, drink as much of the Water/ACV Mixture as you can.\n2:00pm - Mid-Afternoon Snack. This will be your last meal of the day. Choose one of the following 3 options:\nOption #1: Organic Avocados, Organic Lime or Lemon, & Himalayan Crystal Salt. Eat 2-3 organic avocados. Season with salt and fresh lime or lemon juice to taste. Avocados help the body produce glutathione, which is necessary for the liver to cleanse harmful toxins.\nOption #2: Eat 6-8 ounces of raw organic walnuts. Walnuts contain the amino acid arginine, which is necessary to help the liver detoxify ammonia. Walnuts are also high in glutathione and omega-3 fatty acids which support normal liver detoxification. Make sure you chew the nuts until they are liquefied before swallowing.\nOption #3: Water Meal. If you are not hungry or you feel that you can fast through the afternoon, drink as much of the Water/ACV Mixture as you can.\n7:00pm - USP Epsom Salt: Mix 1 tablespoon of Epsom Salt in 8 ounces of warm purified water. Drink it as fast as you can. It is advisable to be near a bathroom when drinking the Epsom Salt as some people experience liquid stools within 20-30 minutes after ingestion.\n8:30pm to 9:00pm: Drink The Olive Oil & Juice: Drink ¾ cup (6 ounces) of organic cold pressed extra virgin olive oil. A small amount (2 tablespoons) of freshly squeezed orange, grapefruit, or lemon juice may be added to improve the taste.\nHow to Drink the Olive Oil: It's important to drink all 6 ounces of the olive oil; below are three approaches to help your experience:\nApproach #1: Thicken the oil by refrigeration for a few hours prior to ingestion to make it go down quickly.\nApproach #2: Thin the oil by using a jar to mix ½ cup of fresh grapefruit or orange juice into the oil and shake until thin.\r\n\tApproach #3: To reduce the taste and texture, gather two cups, straw, and small amount of juice. Place the olive oil in one cup, juice in the other, and use the straw to alternate drinking between the two.\r\n\tImmediately after drinking the oil, go to bed and lie on your right side with your knees drawn up to your stomach for 30 minutes.\nAfter 30 minutes, you can stretch out and go to sleep. If you experience cramping, walk around for ten minutes or so and then go back to bed. You may also feel nauseated during the night. This is due to the release of stored toxins from the liver and gallbladder. This is normal and a sign the liver cleanse is working.\nIf you feel the need to vomit, do so as this will help release toxins. If you vomit, this is a sure sign your body is extremely toxic and you should consider repeating the liver cleanse after a five day break. Do not take Oxy-Powder on this night.\nCongratulations! You have just completed your first liver cleanse.What to Expect After the Liver Cleanse\nUpon waking in the morning, immediately take 6 capsules of Oxy-Powder. This will help your intestinal tract and body flush the stones released from the liver and gallbladder during the night. For breakfast, eat only fruit. For lunch eat the remaining portion of your liver cleanse soup. For dinner eat a healthy meal such as a salad and some protein.\nIf you would like to see the stones, they should appear in your bowel movements for one to two days. We recommend putting a cheap colander over the toilet to collect the stones and then rinse the fecal matter off in the sink. You will be amazed at what comes out of you.\nRepeat the Liver Cleanse if Necessary\nIf you are still experiencing indications after your third flush, this may be a sign you need additional cleanses. The most we have heard of someone completing is 20 back-to-back liver cleanses before their indications were significantly reduced.\nFrequently Asked Questions:1) Can a liver cleanse be performed if the gallbladder has been removed?Yes!\r\n When the gallbladder is removed, the human body generally compensates \r\nfor its absence. The bile duct, found on the visceral side of the liver,\r\n will increase in size to take over the task of bile storage. Some \r\npatients experience diarrhea, Irritable Bowel Syndrome, and other \r\ngastrointestinal disorders whereas others exhibit no post-surgery \r\nsymptoms whatsoever. Keeping\r\n the Liver clean, as it no longer has the support of the Gallbladder, is\r\n vital to help promote a healthy and strong digestive system. 2) Which salt is better to use? Sea Salt vs Epsom Epsom Salts are\r\n required for the liver flush. They provide a strong laxative action and\r\n the Magnesium Sulphate helps relax the bile ducts, which can make it \r\neasier to pass larger stones. The taste of Epsom salts is quite strong \r\nbut regardless of taste, it is an essential ingredient when completing a\r\n liver flush. Sea Salt such as Himalayan crystal salt will not have the \r\nsame effect, there are no alternatives or substitutes.  3) How will I know when my liver is clean?Everyone’s\r\n results differ depending on their diet, exercise patterns, and age as \r\nwell as physical and emotional stress levels. The liver and gallbladder \r\nare never 100% clean since their intended function is to metabolize \r\ntoxic and potentially toxic material. In terms of cleansing, most people\r\n require a minimum of 3 cleansing sessions followed by periodic cleanses\r\n once or twice per year for maintenance. One of the best suggestions is \r\nto judge from the lessening of your indications. Many indications will \r\nsimply resolve spontaneously after the 2nd or 3rd cleanse, while others \r\nmay take 6 or 7 consecutive cleanses and require the identification and \r\nresolution of other factors, i.e. supplementation, external environment,\r\n emotional trauma, spinal/nerve damage, etc. The stools may continue to \r\nbe loose or semi-solid due to the oxidation process from the \r\nOxy-Powder®. Some people will notice a foul smell in the initial stages \r\nof cleansing. Over time, there should be a noticeable decrease in \r\nfoul-smelling bowel movements. A normal and healthy bowel moves in a \r\ntimely manner, with the stool being lighter in color, relatively smooth,\r\n and slick in appearance.4) Will I experience a healing crisis?A\r\n healing crisis describes a phenomenon that sometimes occurs during \r\ncleansing and detoxification of the body and liver. You may feel worse \r\nduring and after your liver cleanse than you did before you started it. \r\nThe accumulation of toxic material must be processed to be removed from \r\nthe body. This process can include physical indications caused by these \r\ntoxins as they are further metabolized or oxidized. The most common \r\nindications include: fatigue, headache, minor rash, lack of mental \r\nclarity, joint or muscle ache, irritability, difficulty sleeping (or \r\nsleeping too much), or mood swings. Some people experience multiple \r\nindications while others have one or none. These indications will go \r\naway in 2 to 3 days as the body naturally expels these toxins. However, \r\nmany people report feeling energetic and experience an increased sense \r\nof well being after the initial liver cleanse. If you feel worse, I \r\nstrongly suggest that you need to continue with the cleansing process \r\nand perform a couple more cleanses. In addition, adopting an organic, raw foods diet and\r\n drinking only purified water with organic raw apple cider vinegar along\r\n with plenty of rest may help you to feel better. Massage and \r\nfar-infrared saunas may also help to eliminate toxins from the body. 5) Can I take Medications while I am performing a Liver Cleanse?You\r\n may continue to take your prescription medications while performing a \r\nliver cleanse. However be sure to take any medications well away from \r\nthe Livatrex formula and 3-6 hours apart from the Oxy-Powder. However, \r\nwe do suggest working with a reputable practitioner in your area, who \r\ncan assist you more directly with these accommodations.\n"}, {"itemid": "MPS-AP-BRZ-1", "subcat": "Alexapure Breeze", "name": "Alexapure Breeze", "img": ["alexapure-side.jpg", "alexapure-front.jpg", "alexapure-filters.jpg", "alexapure-filter-2.jpg"], "price": "$103.60", "desc": " <!--\r\n@import url(https://fonts.googleapis.com/css?family=Raleway:400,500,700);\r\n@import url(http://code.ionicframework.com/ionicons/2.0.1/css/ionicons.min.css);\r\nfigure.snip1477 {\r\n  font-family: 'Raleway', Arial, sans-serif;\r\n  display: inline-block;\r\n  position: relative;\r\n  float: none;\r\n  overflow: hidden;\r\n  margin: 1px 1%;\r\n  min-width: 200px;\r\n  max-width: 220px;\r\n  width: 100%;\r\n  color: #ffffff;\r\n  text-align: center;\r\n  font-size: 16px;\r\n  background-color: #fff;\r\n}\r\nfigure.snip1477 *,\r\nfigure.snip1477 *:before,\r\nfigure.snip1477 *:after {\r\n  -webkit-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  -webkit-transition: all 0.55s ease;\r\n  transition: all 0.55s ease;\r\n}\r\nfigure.snip1477 img {\r\n  max-width: 100%;\r\n  backface-visibility: hidden;\r\n  vertical-align: top;\r\n  opacity: 0.9;\r\n}\r\nfigure.snip1477 .title {\r\n  position: absolute;\r\n  top: 58%;\r\n  left: 25px;\r\n  padding: 5px 10px 10px;\r\n}\r\nfigure.snip1477 .title:before,\r\nfigure.snip1477 .title:after {\r\n  height: 2px;\r\n  width: 400px;\r\n  position: absolute;\r\n  content: '';\r\n  background-color: #ffffff;\r\n}\r\nfigure.snip1477 .title:before {\r\n  top: 0;\r\n  left: 10px;\r\n  -webkit-transform: translateX(100%);\r\n  transform: translateX(100%);\r\n}\r\nfigure.snip1477 .title:after {\r\n  bottom: 0;\r\n  right: 10px;\r\n  -webkit-transform: translateX(-100%);\r\n  transform: translateX(-100%);\r\n}\r\nfigure.snip1477 .title div:before,\r\nfigure.snip1477 .title div:after {\r\n  width: 2px;\r\n  height: 300px;\r\n  position: absolute;\r\n  content: '';\r\n  background-color: #ffffff;\r\n}\r\nfigure.snip1477 .title div:before {\r\n  top: 10px;\r\n  right: 0;\r\n  -webkit-transform: translateY(100%);\r\n  transform: translateY(100%);\r\n}\r\nfigure.snip1477 .title div:after {\r\n  bottom: 10px;\r\n  left: 0;\r\n  -webkit-transform: translateY(-100%);\r\n  transform: translateY(-100%);\r\n}\r\nfigure.snip1477 h2,\r\nfigure.snip1477 h4 {\r\n  margin: 0;\r\n  text-transform: uppercase;\r\n}\r\nfigure.snip1477 h2 {\r\n  font-weight: 400;\r\n}\r\nfigure.snip1477 h4 {\r\n  display: block;\r\n  font-weight: 700;\r\n  background-color: #ffffff;\r\n  padding: 5px 10px;\r\n  color: #000000;\r\n}\r\nfigure.snip1477 figcaption {\r\n  position: absolute;\r\n  bottom: 42%;\r\n  left: 25px;\r\n  text-align: left;\r\n  opacity: 0;\r\n  padding: 5px 60px 5px 10px;\r\n  font-size: 0.8em;\r\n  font-weight: 500;\r\n  letter-spacing: 1.5px;\r\n}\r\nfigure.snip1477 figcaption p {\r\n  margin: 0;\r\n}\r\nfigure.snip1477 a {\r\n  position: absolute;\r\n  top: 0;\r\n  bottom: 0;\r\n  left: 0;\r\n  right: 0;\r\n}\r\nfigure.snip1477:hover img,\r\nfigure.snip1477.hover img {\r\n  zoom: 1;\r\n  filter: alpha(opacity=35);\r\n  -webkit-opacity: 0.35;\r\n  opacity: 0.35;\r\n}\r\nfigure.snip1477:hover .title:before,\r\nfigure.snip1477.hover .title:before,\r\nfigure.snip1477:hover .title:after,\r\nfigure.snip1477.hover .title:after,\r\nfigure.snip1477:hover .title div:before,\r\nfigure.snip1477.hover .title div:before,\r\nfigure.snip1477:hover .title div:after,\r\nfigure.snip1477.hover .title div:after {\r\n  -webkit-transform: translate(0, 0);\r\n  transform: translate(0, 0);\r\n}\r\nfigure.snip1477:hover .title:before,\r\nfigure.snip1477.hover .title:before,\r\nfigure.snip1477:hover .title:after,\r\nfigure.snip1477.hover .title:after {\r\n  -webkit-transition-delay: 0.15s;\r\n  transition-delay: 0.15s;\r\n}\r\nfigure.snip1477:hover figcaption,\r\nfigure.snip1477.hover figcaption {\r\n  opacity: 1;\r\n  -webkit-transition-delay: 0.2s;\r\n  transition-delay: 0.2s;\r\n}\r\n-->\nInfowars Store is proud to introduce the revolutionary air purification system that can dramatically improve the air in your home.\nThe Breeze uses a four-stage purification process, including a true HEPA filter and our patented IonCluster technology. Together, the Breeze eliminates up to 99.97% of airborne contaminants like dust, mold, allergens, bacteria, cold and flu viruses, VOCs and more.\n4 STAGE PURIFICATION\n\n\n\nPHASE 1\nPRE FILTER\n\n\n\nCaptures large particles of dust and hair\n\n\n\n\nPHASE 2\nCARBON FILTER\n\n\n\nRemoves volatile organic compounds, airborne chemicals and ordors from smoke and pets.\n\n\n\n\nPHASE 3\nTRUE HEPA FILTER\n\n\n\nRemoves 99.97% of contaminants as small as 0.3 microns.\n\n\n\n\nPHASE 4\nIONCLUSTER\n\n\n\nSurrounds and kills microbes throughtout your room.\n\nAlexapure Breeze Quick Facts\n\n4-stage purification process for superior air quality\nPatented IonCluster technology kills airborne microbes, with a final byproduct of clean water, not ozone\nIntelligent air quality sensor and indicators\nEasy to Clean and Maintain\nSilent mode at 16dB – quieter than a whisper (30dB)\nEnergy Efficient – cycles 120ft2 every 12 minutes, air change per hour (ACH) exceeds Allergy and Asthma foundation recommendations\nSpace-saving design – about the size of a large briefcase\nPerfect for rooms up to 800 square feet\n\nSystem includes:\n\nOne Purification Unit with IonCluster technology\nOne pre-filter\nOne True HEPA Filter\nOne Carbon Activated Filter\n\n\"NO INTERNATIONAL ORDERS. This item only ships to the United States and Canada.\"   THIS ITEM IS RECEIVING A  HIGH VOLUME OF ORDERS   - PLEASE ALLOW 2-3 WEEKS FOR DELIVERY "}, {"itemid": "MPS-AP-PRO-1", "subcat": "Alexapure Pro Water Filtration System", "name": "Alexapure Pro Water Filtration System", "img": ["alexapure_pro_25_percent_off.jpg", "alexapure_components.jpg", "_m7a3825.jpg"], "price": "$103.60", "desc": " Introducing Alexapure Pro™ from My Patriot SupplyThe Alexapure Pro™ transforms water from virtually any fresh source into clean, healthy drinking water. Pairing the unprecedented, super-filtration power of an all-new gravity block core with a hybrid ceramic shell, it removes up to 99.9999 percent of impurities, including bacteria, disinfectants, volatile organic contaminants (VOAs) and hormones. Because Alexapure Pro requires no electricity, it is ideal for home use, on or off-grid.  Clean, pure drinking water. You can’t survive without it, but where do you get it, and how do you know it’s pure?  My Patriot Supply has finally found the ultimate solution. Alexapure Pro is a groundbreaking, gravity-fed water filtration system that is like no other.  Alexapure Pro relies on gravity to do the heavy lifting so it is the perfect water filtration solution during any emergency - or for everyday use.  With your Alexapure Pro you can filter water from lakes, rivers, streams, wells and municipal water.  Trust Alexapure to supply safe, healthy drinking water for your family.   Each Alexapure Pro Water Filtration system features:\n\n Filter capacity of up to 5,000 gallons\nStainless steel construction\nEasy assembly\nLow maintenance\nGravity powered\nExtended filter life with daily use\nReplacement filters are simple to install\nSpigot provides instant access to pure water\nRaw water capacity: 7.5 liters (2.25 gallons)\nFresh water capacity: 7.5 liters (2.25 gallons)\n\nWhat's in the box?\n\n 1 Alexapure ® gravity block filter w/ hybrid ceramic shell\nInstallation hardware\n1 non-slip black rubber base ring\n1 stainless steel upper chamber\n1 stainless steel lower chamber\n1 stainless steel lid\n1 spigot assembly\n1 knob assembly\n3 rubber plugs\nInstructions for assembly and use \n\nAbout the filter:Each Alexapure Pro system comes with one Alexapure gravity block filter w/ hybrid ceramic shell.  However, your Alexapure Pro system has the capacity for up to 4 filter units, allowing you to increase the flow rate exponentially without sacrificing water quality. Learn more and order additional filters by visiting the Alexapure Certified Filters page. Cleaning and Care:  Your Alexapure Pro requires very little maintenance. It is recommended that you provide the following care as needed.\nCleaning the chambers: The outer surfaces of your stainless steel Alexapure Pro chambers are easy to keep clean by dusting with a soft cloth. Prior to your first use, rinse the interiors with cool, clean water. Cleaning the exterior of the filters:  Mineral content in untreated water may cause build up on the hybrid ceramic shell of the Alexapure ® filter unit. While this in no way affects the filtration process, you can clean the outer surfaces of your filters. Be sure to carefully remove them from the upper chamber first. Scrub them with a scour pad (no soap) and clean water, rinse thoroughly and replace them in the upper chamber. Changing the filters:  The revolutionary Alexapure ® gravity block filter works hard to make your family’s drinking water pure, clean and healthy. Plan to change your filter when you begin to notice a drastic change in flow rate through the filter.\nThe Bottom Line:  Why not experience this revolutionary water filtration system for yourself?  Bring the purest, most refreshing water to your home by ordering today.  ***NO INTERNATIONAL ORDERS. This item only ships to the United States and Canada.***   THIS ITEM IS RECEIVING A  HIGH VOLUME OF ORDERS   - PLEASE ALLOW 2-4 WEEKS FOR DELIVERY Shipping Information:  To ensure quality and to reduce costs, this item ships directly from the supplier. If you purchase additional items, they will be shipped separately. This item does not come with free Citizen's Rulebook and Infowars stickers since it does not ship directly from the Infowars warehouse.  My Patriot Supply reserves the right to use a shipping method that is different than what is selected during check out.  Shipping address can NOT be a PO box for this product."}, {"itemid": "IWL-ANPLX-1", "subcat": "Anthroplex", "name": "Anthroplex", "img": ["anthroplex-tumbnail.jpg", "anthroplex-label.jpg"], "price": "$68.94", "desc": " Introducing Anthroplex, the twice daily pill foundation for men that contains key compounds like horny goat weed, zinc orotate, and a newly balanced blend of hand-selected organic herbs.\n \nWhat You've Been Asking For: Anthroplex Is Finally Here\nFor years, listeners have been asking us to add certain ingredients like horny goat weed and zinc orotate to the Super Male Vitality formula, but the years of research and testing put into the precisely balanced Super Male Vitality formula have proven that the exact ratios of the cold pressed organic herbs are essential to maintain.\nThat's why Anthroplex works synergistically with the powerful Super Male Vitality formula in order to help restore your masculine foundation and stimulate vitality with its own blend of unique ingredients.\n \nAnthroplex's Unique Formula & Ingredients\n \nZinc Orotate\nZinc is an essential dietary mineral that's necessary for proper healthy immune system function, the normal breakdown of food and nutrients, and a number of other processes within the body pertaining to vitality.\n \nHorny Goat Weed - Epimedium\nHorny goat weed, or epimedium, is an herb that has been used for ages in Chinese medicine for vitality, and has also been noted for its antioxidant activity.\n \nTribulus Terrestris\nTribulus Terrestris has been used in Ayurvedic practice as an herb of choice for vitality, and is noted to contain a compound called protodioscin, which is the putative active component of the herb.\n \nTongKat Ali\nAlso known as Malaysian ginseng, TongKat Ali has been traditionally held to support a number of natural functions in men, and was specifically added to the Anthroplex formula using a very specific ingredient ratio.\n \nNow Is The Time...\nNow is the time to start fighting back and rebuilding your foundation. Try Anthroplex today, and see why listeners have been asking us to deliver this high quality formulation at the lowest price out there.\nTry Anthroplex now before our limited first run is out of stock!"}, {"itemid": "TS-BCRAPE", "subcat": "Bill Clinton Rape Shirt", "name": "Bill Clinton Rape Shirt", "img": ["raoe-shirt_1_.png"], "price": "$103.60", "desc": "    It's time we take this viral and have everyone know the truth.  Support this message and get your Bill Clinton Rape Shirt Today!  "}, {"itemid": "AC-BCRW-1", "subcat": "Bill Clinton RAPE Whistle", "name": "Bill Clinton RAPE Whistle", "img": ["rapewhistle_2.png", "rape-whistle-11_1.jpg"], "price": "$103.60", "desc": "    Start the conversation and get the attention of everyone in the room.   The Bill Clinton Rape Whistle is Now for Sale at Infowars Store!   "}, {"itemid": "IWL-BIOPCA-1", "subcat": "Bio-PCA", "name": "Bio-PCA", "img": ["bio-pca--thumbnail.png", "biopcaofficiallabel_optimized_.jpg"], "price": "$68.94", "desc": " Start Supporting Healthy Hair and Nail Appearance\nInfowars Life™ has worked with our leading formulation team to create a profoundly advanced hair, skin, and nails formula that incorporates 14 powerful ingredients into just two easy capsules per day. And as always, we're bringing it to you for the lowest price possible.\nWorking with our chemists, we set out to curate a game-changing nutraceutical formulation that would:\n\nNaturally help to help support healthy hair, nails, and skin\nContain 10,000 mcg of biotin\nIncorporate an advanced proprietary blend of enzymes and collagen\nAmount to a serving size of just two easy capsules daily\nConsist of only the highest quality ingredients\n\nIn addition to containing beneficial nutrients like vitamin E and zinc orotate, Bio-PCA™ is loaded with a carefully balanced proprietary blend of collagen and beneficial enzymes like protease and lipase.\nSome of the Key Ingredients Found In Bio-PCA™\nBiotin - the coenzyme that plays a key role in supporting the health of skin, nerves, digestive tract, metabolism, and cells.\nZinc Orotate – known as an essential trace element that's required for many important biological functions, the human body contains around 2-3 grams of zinc throughout the skeletal muscles, bones, as teeth, hair, and skin.\nSilica from Bamboo Extract – Silica is the most abundant compound in the Earth's crust and can be found throughout nature. As a powerful antioxidant, silica can be essential to a healthy diet. Our high quality silica in Bio-PCA™ is taken from a high quality natural source of bamboo.\nProtease Complex – found in plant sources like papaya and pineapple, protease plays a key role in digesting and utilizing different kinds of proteins in the body as well as many other biological processes\nVitamin C, Vitamin E, and many others\nWhy Choose Bio-PCA™ By Infowars Life?\nWhen it comes to choosing a quality nutraceutical, it's very important to always do your own research before buying. Infowars Life™ has always been obsessed with creating the most high quality formulations out there, and adhering to the ultimate standards of manufacturing quality and safety.\nBio-PCA™ is produced by our leading manufacturer in a state of the art facility that's FDA Current Good Manufacturing Practices (CGMP) registered by the National Science Foundation, and goes through rigorous third-party lab testing for optimum quality.\nWith Bio-PCA™ and Infowars Life™, you're getting an ultra high quality nutraceutical while still supporting the operation. Start supporting the apperance of healthy hair, skin, and nails, and help fund the tip of the spear in the fight for liberty. Try Bio-PCA™ today, and experience the true definition of a 360 Win."}, {"itemid": "IWL-BONESUPP-1", "subcat": "Bone Support", "name": "Bone Support", "img": ["bone-support-single.jpg", "screen_shot_2016-04-19_at_1.32.52_pm.png"], "price": "$103.60", "desc": "    Support your healthy bones and teeth with Bone Support, the new advanced multi-nutrient formulation by InfowarsLife.com. "}, {"itemid": "IWL-BRNFORCE-NS-1", "subcat": "Brain Force Plus", "name": "Brain Force Plus", "img": ["brainforce47percentoff.jpg", "brainforcepluslabel.jpg"], "price": "$68.94", "desc": " The All-New Supercharged Brain Force PLUS™: Because There's A War On For Your Mind!\nTop scientists and researchers agree: we are being hit by toxic weapons in the food and water supply that are making us fat, sick, and stupid. \n It's time to fight back with Brain Force PLUS, the next generation of advanced neural activation. This all-new enhanced formulation not only contains 20% more capsules per bottle, but has been enhanced for maximum potency and even contains a brand new ingredient called Black Pepper Fruit Extract for an added kick.\n“Brain Force has been an absolute favorite among thousands of listeners, with hundreds of 5-star reviews coming in from certified third party review sites. Now, with Brain Force PLUS, we have gone the extra level. This is what I take before a hard-hitting show. I absolutely love it, and the crew does too. This stuff is over the top powerful!” - Alex Jones\nThe Powerful Ingredients Behind Brain Force PLUS:\n\nBacopa Herb Extract: Traditionally used as an important neurological tonic and cognitive enhancer in Ayruvedic medicine.\nAlpha-GPC: A natural compound found in the brain that delivers choline, a water-soluble essential nutrient, across the brain barrier.\nYerba Mate Leaf Powder: Containing natural amounts of caffeine, yerba mate is also loaded with polyphenols like quercetin, as well as potassium, magnesium, and manganese.\nPhosphatidylserine: An important chemical that is responsible for a number of important functions within the body, phosphatidylserine is particularly known for its maintenance of cell structure in the brain.\nL-Theanine: An amino acid that is one of the key constituents of green tea, l-theanine helps transmit nerve impulses in the brain.\nVitamin B12: Vitamin B-12 promotes energy production through supporting the body's natural processes of the adrenal glands, red blood cell formation, and many others.\nBlack Pepper Fruit Extract: taken from the Piper nigrum fruit, black pepper has been used since antiquity as a form of traditional medicine, and was chosen by our chemists to give Brain Force PLUS an extra kick.\n\nIt has taken over a year to develop and procure the all-new Brain Force PLUS formula, with the Infowars Crew and the scientists behind Infowars Life field testing hundreds of different options before choosing the undisputed winning formula that would go on to become Brain Force PLUS.\nNow is the time to secure your bottle and flip the switch for yourself. Supercharge your state of mind with Brain Force PLUS, and see for yourself why the Infowars Crew is powered by this key formula.\n "}, {"itemid": "CTZ-CCV", "subcat": "Citizen Armor Civvy Concealed Armored Vest", "name": "Citizen Armor Civvy Concealed Armored Vest", "img": ["civiconcealedvestfront1200.jpg", "civiconcealedvestback1200.jpg"], "price": "$103.60", "desc": " Carbon NanoTube Technology Body Armor\n\nUltra-Concealable for Everyday Use \nThe Civvy is the civilian answer to military armored vests. It provides the best coverage of all our armor: front, back, and side to side. The Civvy’s carrier is ultra-concealable for everyday use and will provide excellent protection and comfort as you go about your day. Whether blue-collar, white-collar or no-collar, the Civvy will keep you protected from almost any pistol round.\nAs with all our armor, the Civvy is made with CarbonNT, the lightest and strongest soft body armor available. Unlike Kevlar, the Civvy’s armor is also waterproof, so no amount of swimming or sweating is going to undo the ballistic properties of our armor. The antimicrobial, breathable mesh lining will keep you and your armor fresh through the long summer days. No problem with different body types either, because the Civvy adjusts at the shoulders and sides to fit everyone. Do yourself a favor and equip a Civvy today. As George Washington said, “A free people ought not only to be armed but disciplined”. We want our armor in the hands of every responsible citizen of the U.S.A. and we’ll do what we can to make it happen.\nClick here to view the sizing chart for Citizen Armor.\nADDITIONAL SPECS AND DETAILS:\n• Areal density .79 lbs/sq. ft.• CarbonNT – vanguard of carbon nanotube technology• Removable armor shields/washable outer layer• 20-year shelf life• Waterproof• Breathable• Antimicrobial• Maximum shock absorption= less BFD• Shrapnel resistance• Stab resistance up to 20 PSI• Made in the U.S.A.\n* * * CANNOT BE SHIPPED TO CONNECTICUT OR OUTSIDE OF THE U.S. | PLEASE ALLOW 4-6 WEEKS FOR SHIPPING* * *"}, {"itemid": "CZ-SHTF", "subcat": "Citizen Armor SHTF Tactical XPC Vest", "name": "Citizen Armor SHTF Tactical XPC Vest", "img": ["shtf_tactical_xpc_black.png", "shtf_tactical_xpc_brown_2.png", "shtf_tactical_xpc_olive_drab_3.png", "shtf_tactical_xpc_tan_2.png"], "price": "$103.60", "desc": " Carbon NanoTube Technology Body Armor\n\nWhen the SHTF you're going to want the proper equipment to go along with the intense survival training you've been working on. Enter the SHTF armor system from Citizen Armor. A beefier cousin to the Civvy, though not quite as concealable either. The SHTF comes with our high-threat armor which is rated to stop up to .44mag. Whichever tactical carrier you choose to go with, you'll have plenty of molle room to strap on all your goodies. The armor within the SHTF covers the vital areas of the torso front, back and side to side, protecting you from nearly all pistol rounds.\nThe SHTF will watch your back in any tactical situation. Insert your favorite steel plates into your carrier for a mil-spec armor system and the only thing you'll need to replace over the next 20 years is the carrier. Citizen Armor is the only company to warranty soft armor to 20 years. Unrivaled protection from soft body armor, coupled with high-quality and comfortable carriers from these reputable suppliers makes an armor system you will tell your friends about, hopefully before the SHTF.\nClick here to view the sizing chart for Citizen Armor.\nArmor Details:\n\nStops .22 LR, .380, 9mm, .40 Cal, .45 ACP, .357 Mag, .357 Sig, .44 Mag\nAreal density .79 lbs/sq. ft.\nCarbonNT – carbon nanotube technology\nRemovable armor shields/washable outer layer\n20 year shelf life\nWaterproof\nMaximum shock absorption= less BFD\nShrapnel resistant\nStab resistance up to 20 PSI\n\nCarrier Details:\n\nEmergency drag handle Removable shoulder pads, with hook and loop guides\nAdjustable shoulder straps\nHeavyweight webbing for modular attachments\nFront map pocket with snap, hook and loop closure\nBack auxiliary pocket with hook and loop closure\nAdjustable cummerbund with soft armor pockets\nPadded mesh interior lining\nEasy access plate pockets\nImported\n\n* * * CANNOT BE SHIPPED TO CONNECTICUT OR OUTSIDE OF THE U.S. | PLEASE ALLOW 4-6 WEEKS FOR SHIPPING * * *"}, {"itemid": "BK-CITRB-10", "subcat": "10 Pk - Citizens Rule Books", "name": "10 Pk - Citizens Rule Books", "img": ["citizensrulebook_1_.jpg"], "price": "$103.60", "desc": " The Citizens Rulebook is a collection of the most important words of our Founding Fathers which form the bedrock of American liberty. This pocket-sized booklet contains the Constitution, Bill of Rights, Declaration of Independence, and a handbook for jurors. Every citizen of the United States should know these documents.\"You have rights antecedent to all earthly governments; rights that cannot be repealed or restrained by human laws; rights derived from the Great Legislator of the Universe.\"  --John Adams, second President of the United States"}, {"itemid": "DVD-CLIHUS-MM-1", "subcat": "Climate Hustle", "name": "Climate Hustle", "img": ["climatehustle-front-thumbnail.png", "climatehustle-back-thumbnail.png"], "price": "$103.60", "desc": " Scorching temperatures. Melting ice caps. Killer hurricanes and tornadoes. Disappearing polar bears.\nThe end of civilization as we know it! Are emissions from our cars, factories, and farms causing catastrophic climate change? Is there a genuine scientific consensus? Or is man-made “global warming” an overheated environmental con job being used to push for increased government regulations and a new “Green” energy agenda?\nCLIMATE HUSTLE answers these questions, and many, many more. Produced by CFACT and CDR Communications in the one-of-a-kind entertaining and informative style that has made CFACT’s award-winning ClimateDepot.com one of the world’s most sought after sources for reliable, hard-to-find facts about climate issues, this groundbreaking film tears the cover off of global warming hype, and exposes the myths and exaggerations of this multi-billion dollar issue.\n\n "}, {"itemid": "AC-FOAM-1", "subcat": "Combat One 3.7 oz. Field Foam", "name": "Combat One 3.7 oz. Field Foam", "img": ["fieldfoamfront.jpg", "fieldfoamback.jpg"], "price": "$103.60", "desc": " Pentagon Technology Now Available To The Public\n\n\n\nCombat One is the military grade all-purpose skin cleanser, conditioner and protector. A highly versatile and long-lasting cleaning system, Combat One is specifically formulated for:\n\nBroad spectrum hygiene management\nReducing / eliminating odor\nOptimizing natural skin function\nOptimizing natural muscle function\n\nIn those instances where injury is present and the skin has not been compromised use Combat One Foam per the following protocol: \n1. Apply Combat One Foam to hands to clean and protect before therapy begins. \n2. Immediately after the injury gently rub 1 pump of Combat One Foam directly to the localized area of injury until dry. Repeat 3 times. \n3. Reapply 3-4 times daily until injury has healed.\nEach foam bottle contains 3.7 fl oz of formula\n "}, {"itemid": "TS-CINCC", "subcat": "Conservatism is the New Counter Culture T-Shirt", "name": "Conservatism is the New Counter Culture T-Shirt", "img": ["conservatismcountercultureshirtfront.jpg", "conservatismcountercultureshirtback.jpg"], "price": "$68.94", "desc": " Get the all new Infowars T-Shirt featuring Paul Joseph Watson today! "}, {"itemid": "DFNDR-L3ABA-1", "subcat": "DFNDR Backpack Level IIIA Body Armor", "name": "DFNDR Backpack Level IIIA Body Armor", "img": ["backpack_armor_rifle_plate_1.png", "backpack_armor_02_1.jpg", "backpack_armor_03.png", "extra_backpack_armor_01_1.jpg", "extra_backpack_armor_03_1.jpg"], "price": "$68.94", "desc": " <!--\r\n@import url(https://code.ionicframework.com/ionicons/2.0.1/css/ionicons.min.css);\r\n@import url(https://fonts.googleapis.com/css?family=Raleway:400,500,800);\r\n@import url(https://fonts.googleapis.com/css?family=Montserrat:800);\r\n\r\n.snip1255 {\r\n  font-family: 'Raleway', Arial, sans-serif;\r\n  color: #000000;\r\n  text-align: center;\r\n  font-size: 16px;\r\n  width: 100%;\r\n  max-width: 1000px;\r\n  margin: 50px 10px 10px;\r\n}\r\n.snip1255 .plan {\r\n  margin: 0;\r\n  width: 33.3%;\r\n  position: relative;\r\n  float: left;\r\n  background-color: #e6e6e6;\r\n  border: 1px solid #191919;\r\n  box-shadow: 0 0 5px rgba(0, 0, 0, 0.3);\r\n}\r\n.snip1255 .plan:hover i,\r\n.snip1255 .plan.hover i {\r\n  -webkit-transform: scale(1.2);\r\n  transform: scale(1.2);\r\n}\r\n.snip1255 * {\r\n  -webkit-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  -webkit-transition: all 0.25s ease-out;\r\n  transition: all 0.25s ease-out;\r\n}\r\n.snip1255 header {\r\n  position: relative;\r\n  background-color: #262626;\r\n  color: #ffffff;\r\n  padding: 20px 20px;\r\n}\r\n.snip1255 header i {\r\n  font-size: 56px;\r\n  margin: 8px 0;\r\n  color: #c0392b;\r\n  display: inline-block;\r\n}\r\n.snip1255 .plan-title {\r\n  top: 0;\r\n  font-weight: 500;\r\n  margin: 8px 0;\r\n  text-transform: uppercase;\r\n  font-weight: 400;\r\n  letter-spacing: 1px;\r\n}\r\n.snip1255 .plan-cost {\r\n  margin: 8px 0;\r\n}\r\n.snip1255 .plan-price {\r\n  font-family: 'Montserrat', Arial, sans-serif;\r\n  font-weight: 800;\r\n  font-size: 1.3em;\r\n  color: #ffffff;\r\n}\r\n.snip1255 .plan-type {\r\n  opacity: 0.8;\r\n  color: #ffffff;\r\n  font-size: 0.7em;\r\n  text-transform: uppercase;\r\n}\r\n.snip1255 .plan-features {\r\n  padding: 0;\r\n  margin: 0;\r\n  text-align: center;\r\n  list-style: outside none none;\r\n  font-size: 0.8em;\r\n}\r\n.snip1255 .plan-features li {\r\n  border-top: 1px solid rgba(0, 0, 0, 0.2);\r\n  padding: 10px 5%;\r\n  font-weight: 500;\r\n}\r\n.snip1255 .plan-features li:nth-child(even) {\r\n  background: rgba(0, 0, 0, 0.08);\r\n}\r\n.snip1255 .plan-features i {\r\n  margin-right: 8px;\r\n  opacity: 0.4;\r\n}\r\n.snip1255 .plan-select {\r\n  background-color: #191919;\r\n}\r\n.snip1255 .plan-select a {\r\n  color: #ffffff;\r\n  text-decoration: none;\r\n  padding: 20px;\r\n  width: 100%;\r\n  font-size: 0.75em;\r\n  font-weight: 600;\r\n  text-transform: uppercase;\r\n  display: inline-block;\r\n}\r\n.snip1255 .plan-select a:hover {\r\n  background-color: #262626;\r\n}\r\n.snip1255 .featured {\r\n  margin-top: -10px;\r\n  background-color: #262626;\r\n  color: #ffffff;\r\n  box-shadow: 0 0 20px rgba(0, 0, 0, 0.3);\r\n  z-index: 1;\r\n}\r\n.snip1255 .featured .plan-select a {\r\n  padding: 35px 25px;\r\n}\r\n@media only screen and (max-width: 767px) {\r\n  .snip1255 .plan {\r\n    width: 50%;\r\n  }\r\n  .snip1255 .plan-title,\r\n  .snip1255 .plan-select a {\r\n    -webkit-transform: translateY(0);\r\n    transform: translateY(0);\r\n  }\r\n  .snip1255 .plan-select a,\r\n  .snip1255 .featured .plan-select a {\r\n    padding: 20px;\r\n  }\r\n  .snip1255 .featured {\r\n    margin-top: 0;\r\n  }\r\n}\r\n@media only screen and (max-width: 440px) {\r\n  .snip1255 .plan {\r\n    width: 100%;\r\n  }\r\n}\r\n-->\nBACKPACK BODY ARMOR \nLevel IIIA Handgun Plate (FLAT)\nProudly Made in America DFNDR Backpack Level IIIA body armor is extremely lightweight starting at only 1 lb (M). Every aspect of Independently tested to stop multiple rounds of the .357 SIG and the .44 Mag SJHP. DFNDR Backpack Armor is engineered with the highest grade of ballistic materials; an ultra high molecular weight polyethylene (UHMWPE) fiber bound with a resin matrix, to make it a rigid hard stand alone armor system. This armor is tested at muzzle velocity, mitigates spall, and has no deflection.\nBody armor for your backpack, briefcase, computer bag, or vehicle.\n\n100% Made in America\nIndependently tested\nMaterial: Polyethylene\nMulti hit\nTested at muzzle velocity\nTrauma Reducing technology\nThickness: .60 inches\n\n*Multi-Hit Rated*\n\n\nAmmunition\nGAUGE\n\n\n9mm\n9mm\n9mm\n.45 ACP\n.40 S&W\n5.7x28 FN\n.357 Magnum\n.357 SIG\n.44 Magnum\n.44 Magnum\n\nAMMUNITION\n\n\nThreat\nTYPE\n\n\n50 gr Liberty Civil Defense\n1127 gr Ranger S X T P+\n124 gr FMJ RN\n230 gr Speer TMJ\n180 gr JSP\n40 gr SS 197\n158 gr JSP\n125 gr FMJ\n240 gr SWCGC\n240 gr SJHP\n\nTYPE\n\n\nVELOCITY\n(+/- 30 f/ps)\n\n\n2000\n1250\n1400\n830\n1155\n2100\n1430\n1470\n1400\n1430\n\nVelocity\n\n\n\n \nSize Chart\n\n\n\nSize (+/- 5%)\nWeight (+/- 5%)\nThickness (+/- 5%)\nModel #\n\n\nMEDIUM-10x12 \n1 lbs / 0.43 kgs \n0.60 in / 1.52cm \nE-IIIASA-B\n\n\nX-LARGE-11x14 \n1.3lbs / 0.49 kgs \n0.60 in / 1.52cm \nE-IIIASA -B\n\n\n \n \n \n \n\n\n\n \n\n\n* * * CANNOT BE SHIPPED TO CONNECTICUT OR OUTSIDE OF THE U.S. |  PLEASE ALLOW 4-6 WEEKS FOR SHIPPING* * *"}, {"itemid": "EE-BUGSPRAY-NB-1", "subcat": "Herbal Bug Spray - Emric's Essentials", "name": "Herbal Bug Spray - Emric's Essentials", "img": ["b-away_bug_spray-thumbnail.png", "bug_spray_label.png"], "price": "$68.94", "desc": " B-Away Spray (Made with Organic)\nSize: 4 ounce\nAll-Natural, Made from Organic Ingredients, Herbal Outdoor Spray\nA DEET-Free Spray with Aromatherapy Oils to Help Protect Your Skin\n\nNo N-diethyl-m-toluamide (DEET)\nMade from organic ingredients\nAlcohol and mineral oil free\nNo petroleum based ingredients\nNo parabens or preservatives\nNo synthetic additives or scents\nVegetarian, vegan and non-GMO\nFree from artificial colors or preservatives\nFree from yeast, gluten, dairy, soy and corn\nBPA-Free 4oz Bottle\n\nBest Way to Dodge Those Pesky Bugs\nYou probably like to spend most of your summer outdoors and unfortunately having to share your space with bugs is inevitable. Once bitten you are left with itchy, inflamed skin and sometimes can escalate to a much more serious condition, therefore the best way is to simply repel them. Many people have sensitive skin and cannot use bug repellent that contains DEET. And why should you if there are other alternative options? One can get confused with so many selections; however, use your own best judgement. It only makes sense to try a truly organic alternative method.\nWhy This Natural DEET-Free Spray is Your Best Choice?\n\nSince 1995, this natural DEET-Free spray has been in use to help combat insects.\nThe pure aromatherapy essential oils have a pleasant scent for humans, but not for bugs!\nOrganic oils are used to provide you with the most potent and purest formula.\nIt is completely free of any synthetic ingredients and preservatives.\nMade in the USA with certified organic ingredients.\n\nHow to Use this Natural Herbal Spray\nWhen camping or for outdoor activities, spray evenly and coat the skin.\n\n\n* Emric's Essentials ship from a separate warehouse via USPS. You will receive an email once a shipping label has been created for your order.\n ↑ Back To Top"}, {"itemid": "EE-USDEOD-PLS-1", "subcat": "Natural Deodorant - Emric's Essentials", "name": "Natural Deodorant - Emric's Essentials", "img": ["deodorantfront_store.jpg", "deodorantback_store.jpg"], "price": "$68.94", "desc": " Fragrance-Free Sensitive Skin Deodorant for Men and Women\nAluminum-free\n- 100% pure and natural- With organic ingredients- Aluminum free- No petroleum based ingredients- Cruelty-free, vegan and vegetarian- Free from gluten, dairy, soy, no GMO- Free from synthetic fragrances or dyes- Free from beeswax or petrochemicals- Free from phthalates, parabens, preservatives- Oils are hexane free, cold pressed, non-refined, non-deodorized \n6 Reasons Why You Should Use this Fragrance Free Deodorant\n1) This deodorant uses the earth’s mineral crystal combined with natural botanicals to naturally ionize odor;2) An excellent sensitive skin deodorant as it contains the largest size potassium alum molecules that do not absorb through your pores like the conventional aluminum nanoparticles do;3) Even though it is a fragrance free deodorant it effectively works by combatting strong body odor;4) Both, men and women, can use this deodorant stick especially those with sensitive skin;5) Our customers could not believe how well this deodorant lasts throughout the entire day;6) This fragrance free sensitive skin deodorant is made in the USA.\n* Emric's Essentials ship from a separate warehouse via USPS. You will receive an email once a shipping label has been created for your order. Please allow 7-10 days for this item to ship.\n ↑ Back To Top"}, {"itemid": "EE-HBWU-NB-1", "subcat": "Herbal Body Wash - Emric's Essentials", "name": "Herbal Body Wash - Emric's Essentials", "img": ["emrics_body_wash-thumbnail.png", "body_wash_label.png"], "price": "$68.94", "desc": " \nNatural Herbal Body Wash Unscented (Made with Organic)\nSize: 8 ounce (Squeeze Bottle)\nNatural Body Wash, Organic and Unscented\nA Pure Unscented Body Wash that is Free of Chemicals\n\nCertified USDA Made with Organic\nFree from Cocomethyl Betain\nNo petroleum based ingredients\nFree from SLS and Ammonium LS\nCruelty-free, vegan and vegetarian\nFree from parabens and preservatives\nFree from gluten, dairy, corn, non-GMO\nFree from beeswax and petrochemicals\nFree from triclosan, synthetic fragrances and dyes\nOils are hexane free, cold pressed, non-refined, non-deodorized\nBPA-Free 8oz Squeeze Bottle\n\nDoes Your Body Wash Contain Sodium Laureth Sulfoacetate (SLS)?\nSodium Laureth Sulfoacetate (SLS), accepted in the market as a safer alternative to Sodium Laureth or Lauryl Sulfate and added to many natural body products to make them foam, however it is still synthetically processed and is rather questionable on whether it should be added to your organic products. Emric’s EssentialsTM Body Wash DOES NOT contain Sodium Laureth Sulfoacetate.\n5 Reasons Why You Should Use this Organic Unscented Body Wash\n\nThis unscented body wash is certified as “Made with Organic Oils.” Unlike other skin care products that claim to be organic but are not, this product is certified under the USDA National Organic Program.\nA natural body wash organically formulated without skin irritants such as SLS (sodium lauryl sulfate, sodium laureth sulfate, ammonium laureth sulfate and ammonium lauryl sulfate) or any other chemicals or preservatives.\nA pure and simple unscented body wash for the most sensitive skin and for those who are sensitive to scent.\nGently cleanses the skin with organic botanicals leaving the skin smooth and glowing.\nThis natural body wash is made in the USA.\n\nHow to Use this Organic Body Wash\nShake well before use. Squirt a small amount on a natural cotton sponge or bath mitt and wash as usual.\n\n* Emric's Essentials ship from a separate warehouse via USPS. You will receive an email once a shipping label has been created for your order.\n ↑ Back To Top\n"}, {"itemid": "EE-MW-NB-1", "subcat": "Organic Mouth Wash - Emric's Essentials", "name": "Organic Mouth Wash - Emric's Essentials", "img": ["emrics_essentials_mouth_wash.png", "mouth_wash_label.png"], "price": "$68.94", "desc": " \nMouth Wash (1:10 Concentrate)\nSize: 8 ounce\nCertified USDA Organic Mouthwash with Organic Herbs\nWonderful Peppermint Taste Mouthwash without Alcohol\n\nCertified USDA Organic\nCruelty-free, vegan and vegetarian\nFree from gluten, dairy, soy, corn, non-GMO\nFree from SLS, saccharin and ammonium LS\nParaben-free\nFree from triclosan, synthetic chemicals or dyes\nOils are hexane free, cold pressed, non-refined, non-deodorized\nBPA-Free 8oz Bottle\n\n5 Reasons Why You Should Use this All Natural Mouthwash\n\nThis natural mouthwash is Certified USDA Organic.  \nA carefully formulated mouthwash without alcohol, no sugar, no saccharin, no artificial flavors or colors, no fluoride, completely chemical free, cruelty free, vegan and vegetarian.\nThe pure organic plant extracts are concentrated containing antibacterial properties that work well to help tone gums and freshen your breath.\nEffective, yet gentle enough for the most sensitive gums and canker sores.\nThis certified organic antiseptic mouthwash is made in the USA.\n\nHow to Use this All Natural Mouthwash\nThis antiseptic mouthwash is a concentrated formula. Dilute 1 part mouthwash to 10 parts water. The best method is to add a capful of this concentrated mouthwash to a 1/2 cup of water.\nNote: Your taste buds may take a while to adjust to the new experience. Also, most tap water has added fluoride. If you prefer to avoid fluoride, use filtered water when diluting.\n\n\n* Emric's Essentials ship from a separate warehouse via USPS. You will receive an email once a shipping label has been created for your order.\n ↑ Back To Top"}, {"itemid": "EE-NSTT-NB-1", "subcat": "Tea Tree Shampoo - Emric's Essentials", "name": "Tea Tree Shampoo - Emric's Essentials", "img": ["emrics_essentials_tea_tree_shampoo.png", "shampoo_label.png"], "price": "$68.94", "desc": " Size: 8 ounce (Squeeze Bottle)\nA Pure and Natural Tea Tree Shampoo for Itchy Scalp with Natural Plant Ingredients\n\n100% pure tea tree shampoo\nCertified USDA Made with Organic\nCruelty-free, vegan and vegetarian\nSulfate-free, paraben-free shampoo\nAmmonium LS free shampoo for itchy scalp\nFree from synthetic chemicals or dyes\nFree from stearalkonium chloride or dyes\nFree from PEG, ceteareth and polyethylene\nFree from gluten, dairy, soy, corn, preservatives\nFree from octinoxate, salicylic acid, methylparaben\nFree from Cocamidopropyl Betaine or Coco-Betain\nFree of Hydroxypropyltrimonium and other chemicals\nFree from propyl, isopropyl, butyl, isobutyl, DMDM hydantoin\nOils are hexane free, cold pressed, non-refined, non-deodorized\nBPA-Free 8oz Squeeze Bottle\n\nRead Your Shampoo Label Carefully!\nSalicylic acid is normally added to commercially manufactured shampoos for itchy scalp. The National Institutes of Health warns of some of the side effects which include itching or hives, swelling in your face or hands, swelling or tingling in your mouth or throat, chest tightness, trouble breathing.\nMany sulfate-free and paraben-free shampoos still contain detergents and call them by other names ending in “...ates.” Don’t be fooled. Read the Label.\n7 Reasons Why You Should Use this Natural Tea Tree Shampoo\n\nThis natural tea tree shampoo is certified as “Made with Organic.” Unlike other hair care products that claim to be organic but are not, this product is certified under the National Organic Program.\nOnly pure organic antiseptic herbs that have demonstrated natural antimicrobial activity are used.\nAn anti-flake shampoo for itchy scalp that effectively works for mild forms of seborrheic dermatitis and helps alleviate itchy flaky scalp.\nMild enough, yet effective, formula for those exposed to lice and ringworm.\nNot just an anti-flake shampoo for itchy scalp, but it is also gentle enough for color treated hair, henna hair dye users, chemically sensitive scalp and for all hair types leaving your hair clean and shiny.\nThis paraben-free shampoo is made in the USA.\nNote: This is a truly all-natural shampoo with absolutely no chemicals or detergents, therefore it will not perform like a regular shampoo. This shampoo is most suitable for people with shorter hair and results may vary for people with long hair (shoulder length and more).\n\nHow to Use this Natural Shampoo\nPour desired amount of this natural shampoo on the palm of your hand and rub into scalp, then rinse. Please note the texture is very different from a shampoo that contains sulfates. This shampoo will have lower suds. \n\n* Emric's Essentials ship from a separate warehouse via USPS. You will receive an email once a shipping label has been created for your order.\n ↑ Back To Top\n"}, {"itemid": "EE-FBLOTION-NB-1", "subcat": "SPF-30 Sunscreen Lotion- Emric's Essentials", "name": "SPF-30 Sunscreen Lotion- Emric's Essentials", "img": ["emric_s_essentials_spf_30_body_lotion.png", "spf_label.png"], "price": "$68.94", "desc": " \nNatural Unscented Sunscreen with SPF-30\nSize: 4 ounce\nThis Natural SPF-30 Face & Body Lotion Contains Zinc Oxide Without Nano-Particles\n\nNo nano-particles\nWith organic ingredients\nNo petroleum based ingredients\nCruelty-free, vegan and vegetarian\nFree from oxybenzone and octinoxate\nFree from synthetic fragrances and dyes\nFree from gluten, dairy, soy, corn, non-GMO\nFree from phthalates, parabens, preservatives\nFree from beeswax, insects or animal ingredients\nOils are hexane free, cold pressed, non-refined, non-deodorized\nBPA-Free 4oz Bottle\n\n6 Reasons Why You Should Use this Natural Unscented Sunscreen\n\nThis natural spf lotion contains zinc oxide offering natural skin protection for the entire family. The zinc oxide is 21% (largest particle size used) and we do not use nanoparticles. The larger the particle the safer it is for your body. The zinc oxide offers broad spectrum UVA and UVB sun protection. \nDoes not contain oxybenzone or octinoxate, as these ingredients are being questioned due to studies having shown to mimic the hormone es-trogen. \nThe organic oils in this natural spf lotion help hydrate the skin leaving it nice and smooth. \nTruly natural fragrance free sunscreen for the most sensitive skin. \nExcellent sunscreen for face and body that can be worn at all times throughout the day. \nThis unscented sunscreen is made in the USA.\n\nHow to Use this All-Natural Sunscreen Lotion\nShake bottle well. First couple of pumps may have oil in the tube therefore may require pumping a few times. Apply a sufficient amount to cover all areas. You may reapply as often as required especially when swimming. May be used daily, at the beach, park or whenever you want sun protection.\nNote: Like any other natural SPF, a whitish layer is left on the skin.\n\n\n* Emric's Essentials ship from a separate warehouse via USPS. You will receive an email once a shipping label has been created for your order.\n ↑ Back To Top"}, {"itemid": "AC-FLFS-1", "subcat": "Fiber Light Fire Starter", "name": "Fiber Light Fire Starter", "img": ["fiber_light_fire_starter_thumbnail.png", "0k3a1277.jpg", "0k3a1287.jpg", "0k3a1289.jpg"], "price": "$103.60", "desc": " Fiber Light is a natural finely ground wood fiber and wax fire starter. It is water resistant, takes a spark very well, and burns for a long time.  \n\nGreat natural fire starter that takes a spark very well, burns long, and is water resistant.\n\nThe 4oz metal tin Fiber Light is packaged in is 3 inches in diameter with a slip on metal lid. A ranger band is used to help seal and waterproof the tin as well. Hand Made by a USMC veteran, in Southern Oregon, Made in the USA. "}, {"itemid": "AC-CWP-CF-1", "subcat": "Filtered Water Pitcher", "name": "Filtered Water Pitcher", "img": ["water_pitcher_with_filter.jpg", "clearly_filtered_comparison.png", "next_gen_clearly_filtered.png"], "price": "$68.94", "desc": " Filtered water pitcher that reduces and removes fluoride. Now comes with the latest filter technology.  \nHere are some of the key changes you should know about:\n \n\nALL-NEW FILTER INSIDE – The filter underwent a complete redesign that has allowed us to more than double the amount of our proprietary Fluoride Removal MediaTM and Lead Removal MediaTM\nIMPROVED FILTER PERFORMANCE – Huge increases in performance on the contaminants that matter most like: Fluoride (98%), Lead (99%), Chromium-6 (99%), Arsenic (99%), Pharmaceutical Drugs (99%), Hormones (99%) & more!\nALL-New Filter Testing – Independent testing shows the filter’s performance on over 180+ of the most harmful contaminants. Click HERE to see the full report\nNew Flushing Tool – Completely redesigned with a lower profile for easier filter preparation (based on your recommendations)\nNew Filter Gasket – New gasket design featuring SafeSealTM technology to provide a secure connection and superior leak prevention\nNew FILTER Screen – A screen has been added just before the filter to keep unwanted debris from clogging up the filter\n\nClearly Filtered is at the forefront of providing clean water for everyday use.  The Clearly Filtered Water Pitcher uses the most advanced filtration technology available and incorporates it into a fridge-friendly design. Now you can have cold, truly filtered water at your fingertips.  The filter is gravity fed so just fill up the reservoir and wait for the water to filter itself while it chills in the fridge.  Never has getting clean, great tasting tap water been any easier or more convenient.  \n\nClick HERE for official test results.\nPurchase a Clearly Filtered Water Pitcher Relacement Filter.\n\n \nThe Clearly Filtered Water Pitcher blows away the mainline competition, see for yourself:\n Care Instructions:\nThe greatest part about Clearly Filtered products is the filter doesn't need to be cleaned.  The products are designed not to require regular maintenance. The material inside is made from medical grade plastic that prevents mold from growing inside the filter.\n\nHere are a couple suggestions to keep your filtered pitcher in tip-top shape:\n\n    Do not use soap on the filter.\n    Do not place filter in dishwasher.\n    Do not place pitcher in freezer.\n    Do not use with hot water.\n    Do not use with salt water.\n\nWhen to replace the filter? When the flow becomes restricted (approximately 200 gallons or 6 months, whichever comes sooner).\n \nHere is a special sneak peak of the filter to show what is underneath the cover. \n"}, {"itemid": "TS-HILDTOM", "subcat": "Hillary Don't Tread On Me Shirt", "name": "Hillary Don't Tread On Me Shirt", "img": ["hillarytread-shirt-front.png", "hillarytread-shirt-back.png"], "price": "$103.60", "desc": " The Latest Hillary Shirt Is Here!This shirt features Early American Snake Symbolism first seen in 1754The snake symbol came in handy ten years later, when Americans were again uniting against a common enemy. By 1775, the snake symbol wasn't just being printed in newspapers. It was appearing all over the colonies: on uniform buttons, on paper money, and of course, on banners and flags.    Proudly show your support and lets unite to lock her up! Buy the Hillary Don't Tread On Me Shirt. The latest Hillary shirt from Infowars Store!\nMade In America"}, {"itemid": "TS-DGSHFP", "subcat": "Hillary For Prison 2017 Deport George Soros", "name": "Hillary For Prison 2017 Deport George Soros", "img": ["hillarytread-shirt-front_7.png", "hillarytread-shirt-back_7.png"], "price": "$103.60", "desc": " GET THE LATEST HILLARY FOR PRISON SHIRT\n"}, {"itemid": "TS-HILJOK", "subcat": "Hillary Joker Shirt", "name": "Hillary Joker Shirt", "img": ["front-example.jpg", "back-example.jpg"], "price": "$103.60", "desc": "    \"what difference does it make\" Hillary Clinton is a proven criminal and the joke is on the American sheeple!   Now is the time to confront and engage those who refuse to acknowledge or accept the fact that Hillary should be in a prison cell not in a bid for the White House. "}, {"itemid": "BK-HTW-JP-1", "subcat": "How Trump Won: The Inside Story of a Revolution", "name": "How Trump Won: The Inside Story of a Revolution", "img": ["howtrumpwon_frontcover.jpg", "howtrumpwon_backcover.jpg"], "price": "$103.60", "desc": " From the moment Donald Trump announced his candidacy for the White House until very late on Election Night 2016, media and pollsters kept insisting Trump wouldn't--couldn't--be president.  But for Larry Schweikart - one of a ragtag group of amateur politicos called \"The Deplorables\" who had been publishing shockingly accurate polls and predictions - and Joel Pollak - a Breitbart News senior editor following Trump on the campaign trail-Trump's win was a near certainty. Schweikart and Pollak watched the Trump campaign build a powerful coalition between working Americans from both parties; they saw the momentum that the mainstream media and pollsters completely missed; and now, in How Trump Won, they tell the whole incredible story: from the early poll predictions of \"The Deplorables\" to the campaign trail to Election Night.\nAbout the Authors\nJoel Pollak is Senior Editor-at-Large and In-House Counsel at Breitbart News. Pollak is the author of See No Evil: 19 Hard Truths the Left Can't Handle, Wacko Birds: The Fall (and Rise) of the Tea Party, The Kasrils Affair: Jews and Minority Politics in Post-Apartheid South Africa, and Don't Tell Me Words Don't Matter: How Rhetoric Won the 2008 Presidential Election.\nLarry Schweikart is a professor of history at the University of Dayton and the coauthor of A Patriot’s History of the United States, a #1 New York Times bestseller. He is also the author of The Politically Incorrect Guide to the Presidents (Part 1), Seven Events That Made America America, and 48 Liberal Lies About American History.\n "}, {"itemid": "MI76-FSOWS", "subcat": "Infowars Free Speech Wicking Shirt", "name": "Infowars Free Speech Wicking Shirt", "img": ["freespeechshirt_front600x600_1.jpg", "freespeech.jpg", "freespeechshirt_sleeve600x600right_1.jpg"], "price": "$103.60", "desc": " My Free Speech Doesn't End When You're OffendedA hard-hitting message on an incredibly soft shirt.  The back of this new shirt states My Free Speech Doesn't End When You're Offended just underneath the Infowars logo.  The front features a stylish smaller Infowars logo.  There is also a patriotic shield design on the right sleeve.This moisture wicking shirt is luxuriously soft and breathable.  It is made from a durable 70% bamboo and 30% organic cotton mix that is silky soft with a great fit.  Plus it is proudly Made in the USA.  The Infowars Free Speech Wicking Shirt is part of our Made In 1776 line of premium patriot apparel.  Celebrate the spirit of freedom and liberty upon which our nation was founded.  Made in 1776 is dedicated to bringing you distinctive patriotic designs on the highest quality apparel that is proudly Made In America.  "}, {"itemid": "MPS-1YRFS-1", "subcat": "Infowars Life Select: 1 Year", "name": "Infowars Life Select: 1 Year", "img": ["1_year.jpg"], "price": "$103.60", "desc": " Secure Your Food Independence Today With A One Year Survival Food Supply from Infowars Life Select\nInfowars Life Select has partnered with the Patriot Pantry line of survival food to set the industry standard for delicious and nutritious emergency storable foods.\nThe 1-Year Survival Food Supply provides one adult with 1,800 servings of healthy, delicious storable food, drinks and snacks for 365 days.   Packaged in convenient and lightweight 4-Serving mylar pouches, Patriot Pantry low-heat dehydrated food seals in the flavor and high-nutritional value.   Simple and easy to prepare: just boil water, pour in the food, simmer for 10 to 15 minutes and serve up a great meal. \nThe 1 Year Food Supply contains*:\n\nStrawberry Fields Cream of Wheat -- 32 Servings \nMaple Grove Oatmeal -- 224 Servings \nGranny's Homestyle Potato Soup -- 96 Servings  \nTraveler's Stew -- 64 Servings \nBlue Ribbon Creamy Chicken Rice -- 80 Servings\nLiberty Bell Potato Cheddar Soup -- 32 Servings\nTraditional Fettuccine Alfredo -- 64 Servings\nCheesy Broccoli & Rice Soup -- 32 Servings \nCountry Cottage Mac & Cheese -- 96 Servings \nHeartland's Best Mashed Potatoes -- 128 Servings \nCreamy Stroganoff -- 48 Servings \nInstant White Rice -- 80 Servings \nChocolate Pudding -- 120 Servings \nPioneer's Chilli Mac -- 64 Servings \nOrange Energy Drink Mix -- 128 Servings \nSettler's Whey Powdered Milk -- 192 Servings \nButtlermilk Pancake -- 96 Servings\nHoney Coated Banana Chips -- 64 Servings \nSouthwest Savory Rice -- 96 Servings \nRancher's Black Beans & Rice -- 32 Servings \nPotatoes O'Brien -- 32 Servings \n\n \nThis is going to change the way you look at long term survival food supplies. These non GMO meals have a 25 year shelf life, are easy to prepare, and have no added MSG.  Just part of the Patriot Pantry difference.  Every time you eat one of these meals you can rest-assured you are eating healthy, delicious food and saving a lot of money.  Your meals are as delicious and nutritious tonight as they will be in 25 years. \n* In the rare event of a product shortage, we may substitute similar food items of equal or greater value in order to ensure prompt delivery of your order. For questions or concerns, please contact us prior to placing an order.NO INTERNATIONAL ORDERS. This item only ships to the United States and Canada.  THIS ITEM IS RECEIVING A  HIGH VOLUME OF ORDERS   - PLEASE ALLOW 2-4 WEEKS FOR DELIVERY PRICE INCLUDES SHIPPING TO THE CONTIGUOUS UNITED STATES (lower 48 states). To ensure quality and to reduce costs, this item ships directly from the supplier. If you purchase additional items such as a DVD, book, or a t-shirt; normal shipping rates will apply to those items and they will be shipped separately. This item does not come with free Citizen's Rulebook and Infowars stickers since it does not ship directly from the Infowars warehouse.  We reserve the right to use a shipping method that is different than what is selected during check out.  Shipping address can NOT be a PO box for this product.ALASKA AND HAWAII CUSTOMERS:  Due to the significant weight associated with shipping storable foods, there may be additional shipping fees for storable food products to be shipped outside of the continental United States.  CUSTOMERS OUTSIDE THE CONTIGUOUS UNITED STATES: Due to customs fees and regulatory issues regarding the importation of food items, Infowars Life Select only ships to the United States and Canada at this time. Please contact Infowars Customer Service in advance for a shipping quote.  Buyer is responsible for any additional taxes, fees or tariffs. International orders and orders to United States territories may be cancelled and refunded without notice.Delivery Time Update: Due to the high demand for this new product line, please allow 2-4 weeks for shipping. "}, {"itemid": "MPS-3MONTHFS-1", "subcat": "Infowars Life Select: 3 Month", "name": "Infowars Life Select: 3 Month", "img": ["3_months_select_new.jpg", "tote1frontlabel.jpg"], "price": "$103.60", "desc": " Secure your food independence today.\nThree Month Supply--Long Term Survival Food Supply from Infowars Life Select\nInfowars Life Select has partnered with the Patriot Pantry line of survival food to set the industry standard for delicious and nutritious emergency storable foods.\nThe 3-Month Food Supply provides one adult with 450 servings of healthy, delicious storable food, drinks and snacks for 90 days.  Packaged in convenient and lightweight 4-Serving mylar pouches, our low-heat dehydrated food seals in the flavor and high-nutritional value.  Simple and easy to prepare: just boil water, pour in the food, simmer for 10 to 15 minutes and serve up a great meal. \nThe 3-Month Food Supply contains*: \n\nStrawberry Fields Cream of Wheat -- 8 Servings \nMaple Grove Oatmeal -- 56 Servings \nGranny's Homestyle Potato Soup -- 24 Servings  \nTraveler's Stew -- 16 Servings \nBlue Ribbon Creamy Chicken Rice -- 20 Servings\nLiberty Bell Potato Cheddar Soup -- 8 Servings\nTraditional Fettuccine Alfredo -- 16 Servings\nCheesy Broccoli & Rice Soup -- 8 Servings \nCountry Cottage Mac & Cheese -- 24 Servings \nHeartland's Best Mashed Potatoes -- 32 Servings \nCreamy Stroganoff -- 12 Servings \nInstant White Rice -- 20 Servings \nChocolate Pudding -- 30 Servings \nPioneer's Chilli Mac -- 16 Servings \nOrange Energy Drink Mix -- 32 Servings \nSettler's Whey Powdered Milk -- 48 Servings \nButtlermilk Pancake -- 24 Servings\nHoney Coated Banana Chips -- 16 Servings \nSouthwest Savory Rice -- 24 Servings \nRancher's Black Beans & Rice -- 8 Servings \nPotatoes O'Brien -- 8 Servings \n\nThis is going to change the way you look at long term survival food supplies.  These non GMO meals have a 25 year shelf life, are easy to prepare, and have no added MSG.  Just part of the Patriot Pantry difference.  Every time you eat one of these meals you can rest-assured you are eating healthy, delicious food and saving a lot of money.  Your meals are as delicious and nutritious tonight as they will be in 25 years. * In the rare event of a product shortage, we may substitute similar food items of equal or greater value in order to ensure prompt delivery of your order. For questions or concerns, please contact us prior to placing an order.NO INTERNATIONAL ORDERS. This item only ships to the United States and Canada.  THIS ITEM IS RECEIVING A  HIGH VOLUME OF ORDERS   - PLEASE ALLOW 2-4 WEEKS FOR DELIVERY PRICE INCLUDES SHIPPING TO THE CONTIGUOUS UNITED STATES (lower 48 states). To ensure quality and to reduce costs, this item ships directly from the supplier. If you purchase additional items such as a DVD, book, or a t-shirt; normal shipping rates will apply to those items and they will be shipped separately. This item does not come with free Citizen's Rulebook and Infowars stickers since it does not ship directly from the Infowars warehouse.  We reserve the right to use a shipping method that is different than what is selected during check out.  Shipping address can NOT be a PO box for this product.ALASKA AND HAWAII CUSTOMERS:  Due to the significant weight associated with shipping storable foods, there may be additional shipping fees for storable food products to be shipped outside of the continental United States.  CUSTOMERS OUTSIDE THE CONTIGUOUS UNITED STATES: Due to customs fees and regulatory issues regarding the importation of food items, Infowars Life Select only ships to the United States and Canada at this time. Please contact Infowars Customer Service in advance for a shipping quote.  Buyer is responsible for any additional taxes, fees or tariffs. International orders and orders to United States territories may be cancelled and refunded without notice.Delivery Time Update: Due to the high demand for this new product line, please allow 2-4 weeks for shipping. "}, {"itemid": "MPS-4WKFS-1", "subcat": "Infowars Life Select: 4 Week", "name": "Infowars Life Select: 4 Week", "img": ["4_week.jpg"], "price": "$103.60", "desc": " Secure Your Food Independence Today!Four Week Supply--Long Term Survival Food Supply from Infowars Life Select\nInfowars Life Select has partnered with the Patriot Pantry line of survival food to set the industry standard for delicious and nutritious emergency storable foods.\nThe 4-Week Food Supply provides one adult with 140 servings of healthy, delicious storable food, drinks and snacks for 28 days.  Packaged in convenient and lightweight 4-Serving mylar pouches, our low-heat dehydrated food seals in the flavor and high-nutritional value.  Simple and easy to prepare: just boil water, pour in the food, simmer for 10 to 15 minutes and serve up a great meal.\nThe 4-Week Food Supply contains*:\n This is going to change the way you look at long term survival food supplies.  These non GMO meals have a 25 year shelf life, are easy to prepare, and have no added MSG.  Every time you eat one of these meals you can rest-assured you are eating healthy, delicious food and saving a lot of money.  Your meals are as delicious and nutritious tonight as they will be in 25 years. \n* In the rare event of a product shortage, we may substitute similar food items of equal or greater value in order to ensure prompt delivery of your order. For questions or concerns, please contact us prior to placing an order.NO INTERNATIONAL ORDERS. This item only ships to the United States and Canada.  THIS ITEM IS RECEIVING A  HIGH VOLUME OF ORDERS   - PLEASE ALLOW 2-4 WEEKS FOR DELIVERY PRICE INCLUDES SHIPPING TO THE CONTIGUOUS UNITED STATES (lower 48 states). To ensure quality and to reduce costs, this item ships directly from the supplier. If you purchase additional items such as a DVD, book, or a t-shirt; normal shipping rates will apply to those items and they will be shipped separately. This item does not come with free Citizen's Rulebook and Infowars stickers since it does not ship directly from the Infowars warehouse.  We reserve the right to use a shipping method that is different than what is selected during check out.  Shipping address can NOT be a PO box for this product.ALASKA AND HAWAII CUSTOMERS:  Due to the significant weight associated with shipping storable foods, there may be additional shipping fees for storable food products to be shipped outside of the continental United States.  CUSTOMERS OUTSIDE THE CONTIGUOUS UNITED STATES: Due to customs fees and regulatory issues regarding the importation of food items, Infowars Life Select only ships to the United States and Canada at this time. Please contact Infowars Customer Service in advance for a shipping quote.  Buyer is responsible for any additional taxes, fees or tariffs. International orders and orders to United States territories may be cancelled and refunded without notice.Delivery Time Update: Due to the high demand for this new product line, please allow 2-4 weeks for shipping. "}, {"itemid": "MPS-6MONTHFS-1", "subcat": "Infowars Life Select: 6 Month", "name": "Infowars Life Select: 6 Month", "img": ["6_month.jpg"], "price": "$103.60", "desc": " Secure Your Food Independence Today!\nSix Month Long Term Survival Food Supply from Infowars Life Select\nInfowars Life Select has partnered with the Patriot Pantry line of survival food to set the industry standard for delicious and nutritious emergency storable foods.\nThe 6-Month Food Supply provides one adult with 900 servings of healthy, delicious long-term storable food, drinks and snacks for 180 days.   Packaged in convenient and lightweight 4-Serving mylar pouches, our low-heat dehydrated food seals in the flavor and high-nutritional value.   Simple and easy to prepare: just boil water, pour in the food, simmer for 10 to 15 minutes and serve up a great meal. \nThe 6-Month Food Supply contains*:\n\nStrawberry Fields Cream of Wheat -- 16 Servings \nMaple Grove Oatmeal -- 112 Servings \nGranny's Homestyle Potato Soup -- 48 Servings  \nTraveler's Stew -- 32 Servings \nBlue Ribbon Creamy Chicken Rice -- 40 Servings\nLiberty Bell Potato Cheddar Soup -- 16 Servings\nTraditional Fettuccine Alfredo -- 32 Servings\nCheesy Broccoli & Rice Soup -- 16 Servings \nCountry Cottage Mac & Cheese -- 48 Servings \nHeartland's Best Mashed Potatoes -- 64 Servings \nCreamy Stroganoff -- 24 Servings \nInstant White Rice -- 40 Servings \nChocolate Pudding -- 60 Servings \nPioneer's Chilli Mac -- 32 Servings \nOrange Energy Drink Mix -- 64 Servings \nSettler's Whey Powdered Milk -- 96 Servings \nButtlermilk Pancake -- 48 Servings\nHoney Coated Banana Chips -- 32 Servings \nSouthwest Savory Rice -- 48 Servings \nRancher's Black Beans & Rice -- 16 Servings \nPotatoes O'Brien -- 16 Servings \n\n \nThis is going to change the way you look at long term survival food supplies.  These non GMO meals have a 25 year shelf life, are easy to prepare, and have no added MSG.  Just part of the Patriot Pantry difference.  Every time you eat one of these meals you can rest-assured you are eating healthy, delicious food and saving a lot of money.  Your meals are as delicious and nutritious tonight as they will be in 25 years. * In the rare event of a product shortage, we may substitute similar food items of equal or greater value in order to ensure prompt delivery of your order. For questions or concerns, please contact us prior to placing an order.NO INTERNATIONAL ORDERS. This item only ships to the United States and Canada.  THIS ITEM IS RECEIVING A  HIGH VOLUME OF ORDERS   - PLEASE ALLOW 2-4 WEEKS FOR DELIVERY PRICE INCLUDES SHIPPING TO THE CONTIGUOUS UNITED STATES (lower 48 states). To ensure quality and to reduce costs, this item ships directly from the supplier. If you purchase additional items such as a DVD, book, or a t-shirt; normal shipping rates will apply to those items and they will be shipped separately. This item does not come with free Citizen's Rulebook and Infowars stickers since it does not ship directly from the Infowars warehouse.  We reserve the right to use a shipping method that is different than what is selected during check out.  Shipping address can NOT be a PO box for this product.ALASKA AND HAWAII CUSTOMERS:  Due to the significant weight associated with shipping storable foods, there may be additional shipping fees for storable food products to be shipped outside of the continental United States.  CUSTOMERS OUTSIDE THE CONTIGUOUS UNITED STATES: Due to customs fees and regulatory issues regarding the importation of food items, Infowars Life Select only ships to the United States and Canada at this time. Please contact Infowars Customer Service in advance for a shipping quote.  Buyer is responsible for any additional taxes, fees or tariffs. International orders and orders to United States territories may be cancelled and refunded without notice.Delivery Time Update: Due to the high demand for this new product line, please allow 2-4 weeks for shipping. "}, {"itemid": "MPS-SP-SBS-1", "subcat": "Infowars Solar Base Station", "name": "Infowars Solar Base Station", "img": ["solarpack_bag1panel_thumbnail.jpg", "solarpack_front_thumbnail.jpg"], "price": "$68.94", "desc": " \nIntroducing the Infowars Solar Base Station\n\n\n\nSecure your energy self-sufficiency with the Infowars Solar Base Station.  This portable solar power generator provides you with a reliable energy supply that is not dependent upon our vulnerable and deteriorating state-controlled power grid.  It comes with a high-quality 100% monocrystalline solar panel plus a specialized rolling-cart with a protective case so you take it where you need it, when you need it.  With the Infowars Solar Base Station, when the grid goes down - you stay powered up.  We have done\r\nour research and at last found a solar generator that is deserving of the Infowars name.  The\r\nInfowars Solar Base Station is the solar generator that met all of our high standards required to earn the Alex Jones seal of approval.   \nThis solar\r\ngenerator contains a Lithium Iron Phosphate battery. This is not the usual lead-Acid based battery found in other generators that will leak, overheat, or\r\nexplode. This battery is extremely stable and will last up to 8 times longer\r\nthan your typical unit.\nIt also includes a 120 Watt monocrystalline foldable solar panel. This is not the\r\npolycrystalline panels found with other units that are cheaper and less\r\neffective. The monocrystalline panels last longer, yield higher power output,\r\nand tend to perform better than polycrystalline panels under lower light\r\nconditions. \nThe Infowars\r\nSolar Base Station will provide 1500 watts of continuous power and 3000 watts\r\nof peak power to meet all your emergency or camping needs. It has a built in charge\r\ncontroller that will ensure it will not over-charge as well as regulate the\r\ninconsistent power from the sun to give maximum battery life.\nIt has pure sine wave AC output\r\nand DC output, four USB outputs, 100-240 Volt AC input, as well as four\r\nAnderson plugs to connect up to four solar panels at once.\nWe have a\r\nvery limited supply and once we sell out, we will not have more in for months. Product details:\n Lithium Iron Phosphate Battery\nno liquid to leak no liquid to refillCan drain 100% and not affect\r\n     cycle life Extremely Stableno explosions, will not catch\r\n     fire under collision or over charge or short circuitStable to temperatures of 932\r\n     degrees1/3 the weight of Lead AcidEnvironmentally Friendly,\r\n     non-toxic, non-contaminating and doesn’t use any rare metalFast charging (minimum charge\r\n     time is 4 hours!)Long cycle Life: up to\r\n     2000 cycles (8x of Lead Acid and 4x of Li-ion) for full capacity = 80,000AH=800,000,000 mA (eight\r\n        hundred million) on 1 charge you can charge the\r\n     iPad air 45 timesMore stable than lithium ion\r\n     will not overheat or melt down\n\nBuilt\r\nin charge controller\nthis ensures safety to not allow\r\n     an over-chargethis will also regulate and\r\n     “clean” the inconsistent power from the sun to give maximum battery life Solar Panel\n120 WattFoldable for portability100% monocrystalline panels (best you can get; not\r\n     Polycrystalline Silicon panels)Includes 25’ extension\r\n     cord Standard Anderson plugs red and\r\n     black, making it impossible to plug in wrong\n\nFour built in Anderson plugs\nthis allows up to 4 panel arrays\r\n     to be plugged in simultaneouslyup to 900 watts and 30 amps\r\n     can load into this from your solar array\nAC\r\nplug in with fuse\nprotected circuits are\r\n     invaluable simply change the fuse if you get a surge of power just another\r\n     layer of protection for your power investmentPlug in and be ready, if the\r\n     power goes out it will not matter if it is the middle of the night, you’re\r\n     charged and ready. 4-5 hour charge timeNo need to leave plugged in all\r\n     the time when not in use110v 60HzGFCI protected circuit1500 Watt continuous power3000 Watt peak power Inputs\nSolar\n4 Anderson ports for direct\r\n     connection to solar arrayMax Solar input is 900 wattsMax Solar Amps is 30AC \n100V-240V 50Hz to 60Hz\nOutputs\nUSB (4 total)2) 5v 1000mA2) 5v 2100mA12 Volt Anderson12V 20 Amp12 Volt Barrel pure sine waveAC 110 volt 60Hz \n \n   \r\nAccessories\nIncludes rolling CART and\r\n     accessory pack including free LED emergency light.The generator weighs less than\r\n     50 lbs., comes with a carry case that includes an accessory pocket. The roller is easy to use and\r\n     includes a collapsible handle.1 year manufacturer’s warranty.NO INTERNATIONAL ORDERS. This item only ships to the United States.  SHIPPING INFORMATION (lower 48 \r\nstates). To ensure quality and to reduce costs, this item ships directly\r\n from the supplier. If you purchase additional items such as a DVD, \r\nbook, or a t-shirt; normal shipping rates will apply to those items and \r\nthey will be shipped separately. This item does not come with free \r\nCitizen's Rulebook and Infowars stickers since it does not ship directly\r\n from the Infowars warehouse.  The supplier reserves the right to use a shipping \r\nmethod that is different than what is selected during check out to ensure proper delivery.  Shipping address can NOT be a PO box for this product.ALASKA AND HAWAII CUSTOMERS: \r\n Due to the significant weight of this item, \r\nthere may be additional shipping fees for this item to be \r\nshipped outside of the continental United States.  This item may not qualify for Free Shipping during such promotion if it is being shipped outside of the continental United States.\n"}, {"itemid": "BK-JBCF-RS-1", "subcat": "Jeb! And The Bush Crime Family", "name": "Jeb! And The Bush Crime Family", "img": ["jeb_book_cover.jpg"], "price": "$103.60", "desc": " Jeb and the Bush Crime Family is the book that smashes through the layers of lies and secrecy that has surrounded and protected our country's very own political dynasty.New York Times bestselling author and legendary political insider, Roger Stone lashes out with a blistering indictment that exposes the true history and monumental hypocrisy of the Bushes. In his usual “go for the jugular” style, Stone collaborates with Saint John Hunt—author, musician, and son of legendary CIA operative E. Howard Hunt—to make this a “no-holds-barred” history of the Bush family.The authors reveal Jeb to be a smug, entitled autocrat who both uses and hides behind his famous name as he mingles with international drug peddlers. They show how Jeb:Received a $4 million taxpayer bailout when his daddy was Vice PresidentUsed his insider status to make millions from ObamacareAvoided criminal prosecution on a fraudulent Federal loanHypocritically supports the War on Drugs, despite his own shocking drug historyAfter detailing the vast litany of Jeb’s misdeeds, Stone travels back to Samuel, Prescott, George H. W., and George W. Bush to weave an epic story of privilege, greed, corruption, drug profiteering, assassination, and lies. Jeb and the Bush Crime Family will have you asking, “Why aren't these people in prison?”"}, {"itemid": "IWL-KOSS-NS-1", "subcat": "Knockout Sleep Support", "name": "Knockout Sleep Support", "img": ["knockout_50_percent_off.jpg", "knockout_label.jpg"], "price": "$68.94", "desc": " The research is clear: millions around the world struggle to achieve a proper sleep each night, and the negative health effects are staggering.   Over the past year, Infowars Life has been working with our leading chemists to develop a natural sleep support formula that incorporates the most powerful ingredients for the most affordable price.   KNOCKOUT goes above and beyond many natural sleep formulas. Unlike many sleep formulas that only just contain one or two ingredients for a similar price, KNOCKOUT harnesses the power of:  Valerian Root Extract: Traditionally used as far back as ancient Greece and Rome as a medicinal herb, a prominent Greek physician Galen of Pergamon dubbed valerian root as a remedy for sleeplessness.L-Tryptophan: An essential amino acid, l-tryptophan is also a biochemical precursor to the production of serotonin, which can be naturally converted by the body into melatonin, all of which support normal, healthy sleep.Melatonin: A hormone made by the pineal gland that is absolutely essential in the function of controlling sleep and wake cycles. Foods like meats and fruits contain melatonin in very small amounts.Lemon Balm Leaf Extract: An essential oil known for its many soothing benefits.G.A.B.A.: A chemical created in the brain that plays a key role in nervous system relaxation.And many others, including Chamomile Flower Extract, Hops Flower Extract, and L-Theanine.  Help support the operation and feel the power of KNOCKOUT! Get KNOCKOUT today and experience the benefits of our latest natural sleep formula. "}, {"itemid": "HR-FDL", "subcat": "Harvest Right Large Freeze Dryer", "name": "Harvest Right Large Freeze Dryer", "img": ["01-large-satinwhite-dimensions-500x500.png", "01-large-stainless-500x500.png", "01-large-blackonblack_1.png"], "price": "$103.60", "desc": "  Freeze Dryer - Large\nThis patented technology has the capability of freeze drying 3.5 to 4.0 gallons (3.5 to 4.0 #10 cans) per 24-hour batch. In a year’s time, you can easily freeze dry  670 gallons of food. All of which will keep nearly 100% of its nutrition.\n\nEasy to use. Just press start and the freeze dryer will beep when finished.\n220 Volt Power Source\nPreserve food for up to 25 years with your own freeze dryer\nPerfect for freeze-drying fruits, vegetables, meats, dairy products, meals, desserts, and more\n\nLarge Harvest Right Freeze Dryer includes:\n\nFreeze Dryer\nCommercial Grade Vacuum Pump\nFive (5) Stainless Steel Trays\nOwner’s Manual\nDimensions: 32.5” Tall x 22.5” Wide x 25.5” Deep – perfect for a countertop, cart, or table\n\n \n\n \nThis image shows both the freeze dryer and the vacuum pump together. This is part of the complete solution that everyone receives when they purchase a freeze dryer.\nThe following description illustrates how the components shown here (freeze dryer and vacuum pump) work to freeze dry food:\n\nThe process is simple. The food freezes to an ultra cold temperature. The chamber the food is in becomes a vacuum and the water evaporates out of the food.\nThe process is automatic. The person using the freeze dryer simply presses “Start” and the process runs to completion.\nIt doesn’t matter what one puts in the freeze dryer. There can be pineapple on one shelf, turkey on another, yogurt on a third, and a leftover meal (like chili or stroganoff) on the last shelf.\n\n \nHOW IT WORKS\n<!--\r\n@import url(https://fonts.googleapis.com/css?family=Source+Sans+Pro);\r\n@import url(https://fonts.googleapis.com/css?family=Teko:700);\r\n.snip1563 {\r\n  background-color: #fff;\r\n  color: #ffffff;\r\n  display: inline-block;\r\n  font-family: 'Source Sans Pro', sans-serif;\r\n  font-size: 12px;\r\n  margin: 1px 5px;\r\n  max-width: 215px;\r\n  min-width: 200px;\r\n  overflow: hidden;\r\n  position: relative;\r\n  text-align: right;\r\n  width: 100%;\r\n}\r\n\r\n.snip1563 *,\r\n.snip1563 *:before,\r\n.snip1563 *:after {\r\n  -webkit-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  -webkit-transition: all 0.45s ease;\r\n  transition: all 0.45s ease;\r\n}\r\n\r\n.snip1563 img {\r\n  backface-visibility: hidden;\r\n  max-width: 100%;\r\n  vertical-align: top;\r\n}\r\n\r\n.snip1563:before,\r\n.snip1563:after {\r\n  position: absolute;\r\n  top: 0;\r\n  bottom: 0;\r\n  left: 0;\r\n  right: 0;\r\n  content: '';\r\n  background-color: #10335C;\r\n  opacity: 0.5;\r\n  -webkit-transition: all 0.45s ease;\r\n  transition: all 0.45s ease;\r\n}\r\n\r\n.snip1563:before {\r\n  -webkit-transform: skew(70deg) translateX(80%);\r\n  transform: skew(30deg) translateX(80%);\r\n}\r\n\r\n.snip1563:after {\r\n  -webkit-transform: skew(-30deg) translateX(70%);\r\n  transform: skew(-50deg) translateX(60%);\r\n}\r\n\r\n.snip1563 figcaption {\r\n  position: absolute;\r\n  top: 0px;\r\n  bottom: 0px;\r\n  left: 0px;\r\n  right: 0px;\r\n  z-index: 1;\r\n  bottom: 0;\r\n  padding: 20px 20px 20px 40%;\r\n}\r\n\r\n.snip1563 figcaption:before,\r\n.snip1563 figcaption:after {\r\n  position: absolute;\r\n  top: 0;\r\n  bottom: 0;\r\n  left: 0;\r\n  right: 0;\r\n  background-color: #10335C;\r\n  box-shadow: 0 0 20px rgba(0, 0, 0, 0.7);\r\n  content: '';\r\n  opacity: 0.5;\r\n  z-index: -1;\r\n}\r\n\r\n.snip1563 figcaption:before {\r\n  -webkit-transform: skew(30deg) translateX(100%);\r\n  transform: skew(30deg) translateX(100%);\r\n}\r\n\r\n.snip1563 figcaption:after {\r\n  -webkit-transform: skew(-30deg) translateX(90%);\r\n  transform: skew(-30deg) translateX(90%);\r\n}\r\n\r\n.snip1563 h3,\r\n.snip1563 p {\r\n  margin: 0;\r\n  opacity: 0;\r\n  letter-spacing: 1px;\r\n}\r\n\r\n.snip1563 h3 {\r\n  font-family: 'Teko', sans-serif;\r\n  font-size: 36px;\r\n  font-weight: 700;\r\n  line-height: 1em;\r\n  text-transform: uppercase;\r\n}\r\n\r\n.snip1563 p {\r\n  font-size: 0.9em;\r\n}\r\n\r\n.snip1563 a {\r\n  position: absolute;\r\n  top: 0;\r\n  bottom: 0;\r\n  left: 0;\r\n  right: 0;\r\n  z-index: 1;\r\n}\r\n\r\n.snip1563:hover h3,\r\n.snip1563.hover h3,\r\n.snip1563:hover p,\r\n.snip1563.hover p {\r\n  -webkit-transform: translateY(0);\r\n  transform: translateY(0);\r\n  opacity: 0.9;\r\n}\r\n\r\n.snip1563:hover:before,\r\n.snip1563.hover:before {\r\n  -webkit-transform: skew(30deg) translateX(30%);\r\n  transform: skew(30deg) translateX(30%);\r\n  -webkit-transition-delay: 0.05s;\r\n  transition-delay: 0.05s;\r\n}\r\n\r\n.snip1563:hover:after,\r\n.snip1563.hover:after {\r\n  -webkit-transform: skew(-30deg) translateX(20%);\r\n  transform: skew(-30deg) translateX(20%);\r\n}\r\n\r\n.snip1563:hover figcaption:before,\r\n.snip1563.hover figcaption:before {\r\n  -webkit-transform: skew(30deg) translateX(50%);\r\n  transform: skew(30deg) translateX(50%);\r\n  -webkit-transition-delay: 0.15s;\r\n  transition-delay: 0.15s;\r\n}\r\n\r\n.snip1563:hover figcaption:after,\r\n.snip1563.hover figcaption:after {\r\n  -webkit-transform: skew(-30deg) translateX(40%);\r\n  transform: skew(-30deg) translateX(40%);\r\n  -webkit-transition-delay: 0.1s;\r\n  transition-delay: 0.1s;\r\n}\r\n-->\n \nsTEP 1\nFresh or cooked foods are placed in the dryer where they are frozen to -40 degrees Fahrenheit or colder.\n\n \nsTEP 2\nOnce the food is frozen, the freeze dryer creates a powerful vacuum around the food. Then, as the food is slightly warmed, the ice transitions into vapor and evaporates.\n\n \nStep 3\nThe freeze-dried food is then sealed in moisture and oxygen-proof packaging (Mylar bags, mason jars, or cans) along with an oxygen absorber to ensure freshness until opened.\n\n \nStep 4\nWhen water is added to the food it regains its original fresh flavor, aroma, and appearance!\n\n\nPRICE INCLUDES SHIPPING TO THE CONTIGUOUS UNITED STATES.  NO INTERNATIONAL ORDERS. ADDITIONAL SHIPPING CHARGE REQUIRED FOR ORDERS BEING SHIPPED TO ALASKA OR HAWAII.  To ensure quality and to reduce costs, this item ships directly from the supplier. We reserve the right to use a shipping method that is different than what is selected during checkout."}, {"itemid": "IWL-LIVSHD-1", "subcat": "Liver Shield", "name": "Liver Shield", "img": ["livershield_product.jpg", "livershield_label.jpg"], "price": "$103.60", "desc": "\nIs your liver toxic?  \nClick here for the Advanced Liver Cleanse\n  With all of the toxic additives in the food supply, the pharmaceutical drugs in the water, and of course the consumption of alcohol, the answer may be a resounding “YES!” \nThe all-new Infowars Life Liver Shield™ is a 100% all natural blend of powerful organic and wildcrafted herbs specifically formulated to support natural function and detoxification of the liver and gallbladder.\nThe liver is responsible for over 500 separate functions in the body, and is known to be your primary 'filter' within the body. \nFollowing prolonged toxic buildup, your liver can become full of fatty deposits, built up toxins, and even  dangerous objects known as 'liver stones'. These stones build up in your liver when excess lipids start to crystallize, turning into pebble-sized stones. \nA healthy liver helps with digestion, energy levels, body detoxification, and so many other important functions\n \nOur Proprietary Process Based on Powerful Organic Herbs\nThat's why I'm excited to announce that Liver Shield™ is the only liver support product on the market that uses a patented Spagyrex®  blend of powerful organic herbs that support detoxification. \nAs always, Liver Shield™ also follows the highest quality standards for nutraceutical grade manufacturing. \nLiver Shield™is:\n\n100% true alcohol free.\nVegan Safe and GMO Free.\nKosher, Halal and Vegan Safe.\nMade with organic and wild cultivated herbs.\nMade in the USA using Eco-friendly sustainable manufacturing.\nNever tested on animals.\n\nShocking Stats About Liver Health\n\nAccording to the National Center for Health Statistics, chronic liver diseases are among the most common causes of death in the United States.\nAlmost 26,000 people in the US die each year from cirrhosis, The American Liver Foundation warns that alcohol abuse contributes to most incidences of cirrhosis.\nUp to 20% of the population has liver stones and gallstones.\nA poor diet is a major contributor to most liver problems and toxic buildup.\nMore than 900 prescription drugs can injure the liver and 80% of all cases of liver toxicity are caused by drug reactions.\n29 million Americans have nonalcoholic fatty liver disease.\n90% of heavy alcohol drinkers develop fatty liver disease. \n6,000 - 10,000 liver transplants are performed yearly in the United States.\n\nHow to Use Liver Shield™ \nFor General Liver Support\nMix 2 full droppers with 4 ounces purified water and drink before breakfast 2 to 3 times weekly.\nThe 6 Day Advanced Liver Cleanse\nTo view full instructions, click here.\nTry The Infowars Life Liver Shield™ Today\nOur Infowars Life Liver Shield™ is easy to take, made in the USA, and helps support the message of truth and liberty. Try yours today and help support the natural functions of your body's main filter.\nIngredients:  Wildcrafted Borotutu (bark), Organic Yellow Dock (root), Organic Dandelion (root), Wildcrafted Chanca Piedra (herb), Organic Greater Celandine (herb), Organic Chicory (root), Organic Milk Thistle (seed), Organic Turmeric (rhizome), Organic Peppermint (leaf) Fulvic Acid.\nFrequently Asked Questions:\n1) Can a liver cleanse be performed if the gallbladder has been removed?\nYes! When the gallbladder is removed, the human body generally compensates for its absence. The bile duct, found on the visceral side of the liver, will increase in size to take over the task of bile storage. Some patients experience diarrhea, Irritable Bowel Syndrome, and other gastrointestinal disorders whereas others exhibit no post-surgery symptoms whatsoever. \nKeeping the Liver clean, as it no longer has the support of the Gallbladder, is vital to help promote a healthy and strong digestive system.\n 2) Which salt is better to use? Sea Salt vs Epsom\n Epsom Salts are required for the liver flush. They provide a strong laxative action and the Magnesium Sulphate helps relax the bile ducts, which can make it easier to pass larger stones. The taste of Epsom salts is quite strong but regardless of taste, it is an essential ingredient when completing a liver flush. Sea Salt such as Himalayan crystal salt will not have the same effect, there are no alternatives or substitutes. \n \n3) How will I know when my liver is clean?\nEveryone’s results differ depending on their diet, exercise patterns, and age as well as physical and emotional stress levels. The liver and gallbladder are never 100% clean since their intended function is to metabolize toxic and potentially toxic material. In terms of cleansing, most people require a minimum of 3 cleansing sessions followed by periodic cleanses once or twice per year for maintenance. One of the best suggestions is to judge from the lessening of your indications. Many indications will simply resolve spontaneously after the 2nd or 3rd cleanse, while others may take 6 or 7 consecutive cleanses and require the identification and resolution of other factors, i.e. supplementation, external environment, emotional trauma, spinal/nerve damage, etc. The stools may continue to be loose or semi-solid due to the oxidation process from the Oxy-Powder®. Some people will notice a foul smell in the initial stages of cleansing. Over time, there should be a noticeable decrease in foul-smelling bowel movements. A normal and healthy bowel moves in a timely manner, with the stool being lighter in color, relatively smooth, and slick in appearance.\n \n4) Will I experience a healing crisis?\nA healing crisis describes a phenomenon that sometimes occurs during cleansing and detoxification of the body and liver. You may feel worse during and after your liver cleanse than you did before you started it. The accumulation of toxic material must be processed to be removed from the body. This process can include physical indications caused by these toxins as they are further metabolized or oxidized. The most common indications include: fatigue, headache, minor rash, lack of mental clarity, joint or muscle ache, irritability, difficulty sleeping (or sleeping too much), or mood swings. Some people experience multiple indications while others have one or none. These indications will go away in 2 to 3 days as the body naturally expels these toxins. However, many people report feeling energetic and experience an increased sense of well being after the initial liver cleanse. If you feel worse, I strongly suggest that you need to continue with the cleansing process and perform a couple more cleanses. In addition, adopting an organic, raw foods diet and drinking only purified water with organic raw apple cider vinegar along with plenty of rest may help you to feel better. Massage and far-infrared saunas may also help to eliminate toxins from the body.\n \n5) Can I take Medications while I am performing a Liver Cleanse?\nYou may continue to take your prescription medications while performing a liver cleanse. However be sure to take any medications well away from the Livatrex formula and 3-6 hours apart from the Oxy-Powder. However, we do suggest working with a reputable practitioner in your area, who can assist you more directly with these accommodations."}, {"itemid": "IWL-LIVDEF-1", "subcat": "Living Defense", "name": "Living Defense", "img": ["livingdefense_single2.jpg", "livingdefenselabelupdate.jpg"], "price": "$103.60", "desc": " Help Eliminate Toxic & Harmful Organisms From Your Body Living Defense™ is a comprehensive blend of all-natural ingredients formulated to promote the cleansing and detoxification of harmful organisms. Harmful organisms are everywhere and can be transmitted by people, pets, the environment, food, and water. They steal your nutrients and release toxic waste into your body. When you've been infiltrated and become a dumping ground for these critters, your health can suffer. It's time to start helping your body naturally cleanse these unwanted invaders.  Top 5 Reasons You Need Living Defense™1. Harmful Organisms Negatively Affect Your HealthImagine if you opened the doors and windows to your home and let the wildlife enter and live, unchecked. How long would it take before a state of disaster would be declared? The inside of your body is the same way, harmful organisms release waste and weaken your immune system.2. Harmful Organisms Rob Your Body of NutritionHarmful organisms are just like any other living organism -- they need nutrition to survive. When they've taken up residence in your body, that nutrition comes from you. Harmful organisms feed off your food and steal your nutrients.3. Harmful Organism Infestation is CommonContaminated food, water, air... nobody is immune to exposure from harmful organisms. In fact, you may be affected right now and not even know it. Indications can vary from none, to mild discomfort, to serious disease. If you experience abdominal discomfort, digestive issues or constipation, nausea, malaise, weakness, loose stools, or weight fluctuations it could be a big sign you're being affected by harmful organisms.4. Living Defense™ is Unparalleled QualityYou can buy a cheaper \"harmful organism cleansing\" supplement but you can't buy a better one. Do you really want to waste your money on a product made with low quality herbs that have unknown or questionable origin? Pesticide laced \"herbs\" from China are a real problem you don't have to worry about with Living Defense™. Choose Living Defense™ and avoid the frustration of dealing with ineffective, junk supplements.5. Living Defense™ Supports Full Body CleansingColon cleansing, liver cleansing, and chemical and toxic metal cleansing are all plans that offer incredible benefits, especially when performed semi-regularly and in succession. Harmful organism cleansing with Living Defense™ is your next piece of the puzzle.5 Shocking Statistics About Harmful Organisms\n\nNine out of ten people are infested with harmful organisms.\nPork, shellfish, and contaminated food are sources of exposure in America.\nAnimals, including pets are more prone to infestation and can pass it to humans.\nAn infestation may not be noticed for years, at which point your health has already suffered.\nHarmful organisms can even be spread during sexual activity.\n\nLiving Defense Ingredients:Wildcrafted Black Walnut (green hull)Black walnut hull is of the most potent herbs for removing harmful organisms from the intestinal tract. The high tannin content of the green hull is primarily responsible for this effect. Other constituents such as juglandin, juglone, and juglandic acid are also involved in the purging process. Research suggests black walnut can oxygenate the blood to create a hostile environment to harmful organisms. The green husk also contains organic iodine, which assists the cleansing of harmful organisms.Organic Epazote (leaves, seed)Rich in ascaridole, epazote is an herb of choice for attacking and expelling various harmful organisms that take up residence in the intestinal tract.Wildcrafted Quassia (bark)The Quassia grows naturally throughout South America and has a particular interesting quality -- no bugs or insects ever bother it. The resin contains a compound known as quasi, which naturally repels insects.Organic Clove (bud)Clove Bud is considered one of the best herbs for killing eggs from harmful organisms and it also discourages fungus.Organic wormwood [Artemisia absinthium] (leaf/stem)Wormwood has been used as an intestinal cleansing herb as far back as 1600BC. Wormwood creates an extremely hostile environment for harmful organisms in your intestinal tract and promotes healthy digestion by increasing liver and gallbladder secretions.Veganzyme® Blend: (Protease with DPPIV, Amylase, Glucoamalyse, Lactase, Cellulase [I,II], Maltase, Hemicellulase, Xylanase, Beta Glucanase, Serrapeptase, Nattokinase, Bromelain, Papain, alpha Galactosidase, Lipase, Catalase, Invertase, Pectinase, Phytase, Glucose Oxidase)VeganZyme® is the most advanced, full-spectrum, systemic and digestive enzyme supplement available. Completely toxin-free, this formula supports digestion and helps your body break down and expel harmful invaders and their toxic byproducts.Other Ingredients:Natural diatomaceous earthKosher certified vegetarian capsulesGet Started Today and Cleanse Your Body With Living Defense™!"}, {"itemid": "AC-MLLP-1", "subcat": "Molon Labe Pin", "name": "Molon Labe Pin", "img": ["molonlabe_pin_front.jpg", "molonlabe_pin_closeup.jpg", "molonlabe_pin_back.jpg"], "price": "$103.60", "desc": " The Infowars Molon Labe Pin is a great for denim jackets, biker vests, or hats but can also be used on a more formal lapel.  It  is\r\n handcrafted in the USA from high quality queens metal pewter.  Features a detail Spartan helmet framed by the words Molon Labe.  Has two brass butterfly clasps to make sure your pin stays securely fastened. These pins are \r\ncast in queens metal pewter which has no lead pewter.  It has a small percent \r\nof silver in the alloy for strength and a nice \"white\" color when \r\nfinished.  Molon Labe is ancient Greek for \"come and take it\" and has been a battle cry against tyranny throughout the ages.  Get this hand-crafted pin and show your support the Second Amendment.  Let everyone know that if they want your guns then they will have to come and take it.Measures 1.25\" by 1.75\".  "}, {"itemid": "MI76-MLCATI-TS", "subcat": "Molon Labe T-Shirt", "name": "Molon Labe T-Shirt", "img": ["molonlabet-shirt_f__1.jpg", "molonlabet-shirt_b_.jpg"], "price": "$103.60", "desc": " Molon Labe - Come and Take ItMolon Labe (pronounced mo'lon la've) is ancient Greek for \"come and take it\" and traces its roots back to the famous Spartan Battle of Thermopylae of 300 lore.  This classical expression of defiance goes back to the days of the ancient Greeks.  It was reportedly spoken by King Leonidas I in response to the Persian army's demand that the Spartans surrender their weapons at the Battle of Thermopylae.   Today we are faced with a similar choice.  The globalists want free men to surrender their right to bear arms and become slaves to the New World Order.  The famous story of the 300 Spartans has inspired people throughout the ages to fight for their ideals, even in the face of overwhelming odds.  This latest Infowars shirt honors and inspires this tradition of free men courageously fighting for their country and freedom.  Black shirt with distressed gold ink combines both classic Greek/Spartan imagery with modern M16 assault rifles.  It has Molon Labe printed across the top with Infowars at the bottom in an ancient Greek inspired font.  The back also features an ancient Greek Infowars logo with \"1776\" written in Roman numerals.  The Molon Labe Infowars T-shirt is part of the Made In 1776 line of American made products.  Printed on a high quality, Made in the USA, 100% cotton t-shirt.  Made In 1776--Premium Patriot Apparel:  Celebrate the spirit of freedom and liberty upon which our nation was founded.  Made in 1776 is dedicated to bringing you distinctive patriotic designs on the highest quality apparel that is proudly Made In America.  Join the revolution, your purchase not only supports the Infowar, it supports America.   "}, {"itemid": "IWL-OCCUPWR-1", "subcat": "Occu Power", "name": "Occu Power", "img": ["occupower-bottle.png", "occupower-label.png"], "price": "$103.60", "desc": " Open Your Eyes! Occu-Power  by Infowars Life  is a new formulation specifically designed to nutritionally assist the natural function of healthy eyes.Arguably the most important sense, sight is the primary input to the brain. Combining key ingredients like astaxanthin, lutein, and Eyebright herb extract, Occu-Power is a long awaited 'super formula' now available exclusively through the Infowars Life line.Key Ingredients Found In Occu-Power  by Infowars Life:Vitamin AZincEyebright Herb ExtractBilberry Fruit ExtractN-Acetyl-L-CysteineBlack Currant Fruit ExtractSatiereal®  (Saffron Bulb Extract)LuteinZeaxanthinAstaxanthin ExtractSecure the latest addition to the super high quality Infowars Life formulations line today with Occu-Power and open your eyes!"}, {"itemid": "WF-G2-POG7", "subcat": "ProOne 7\" G2.0 filter elements (pair)", "name": "ProOne 7\" G2.0 filter elements (pair)", "img": ["proone_g2.0_25_off_1.jpg"], "price": "$68.94", "desc": " Introducing the ProOne G2.0 Hi-Performance Water & Fluoride filter element:  The ProOne G2.0 Hi-Performance Water & Fluoride filter element by Propur is the result of years of research, design, development and innovation.   Whether for daily use or emergency preparedness, Propur filters are ideal for use with just about any water source including lakes, rivers, streams, ponds, rain and tap water.  The new ProOne G2.0 Water & Fluoride filter with advanced manufacturing technology combines silver impregnated, self-sterilizing white ceramic with new AquaMetix media for removal of fluoride and other heavy metals, ALL-IN-ONE filter element.  No need to purchase any additional fluoride filters! There is no other filter like this on the market.What contaminants does the ProOne G2.0 filter take out?The ProOne G2.0 filters remove and reduce a wide variety of natural and commercial water contaminants including pathogenic bacteria, cysts, heavy metals, pesticides and  fluoride.  Below are detailed examples regarding some of the recent news-making water contaminants.  Visit the ProOne G2.0 Technical Information Page for more detailed information. \n\nGlyphosate:  The latest test results show the new ProOne G2.0 Water & Fluoride filter removes glyphosate.  More commonly known as Monsanto's Roundup, glyphosate is a very common herbicide used in commercial farming and landscaping.  Glyphosate water contamination is increasing due to run-off cause by the wide-spread use of Roundup in GMO crops.\nWest Virginia Elk River Chemical Spill (January 2014):  Industrial chemical spills happen and not all of them garner the media attention as the January 2014 Elk River Spill in West Virginia.  The leakage of 4-Methyl-1-cyclohexanemethanol (MCHM) left 300,000 residents without access to potable water.  It was the third chemical accident to occur in that area in just 5 years.  Propur conducted testing that showed ProOne G2.0 removes 99.89% of the spilled chemical 4-Methyl-1-cyclohexanemethanol (MCHM).  \nToledo, Ohio Microcystin-LR Contamination (August 2014):  In August of 2014 the public officials (servants) of Toledo, OH detected higher than \"acceptable\" levels of microcystin due to harmful algal blooms (HABS).  This resulted in tap water being cut off to approximately 500,000 people.  Propur tested their filters for Microcystin-LR reduction.  Independent lab results concluded the the Propur G2.0 filter systems reduced the Microcystin LR concentration in the tap water by at least 99.0%. \n\nIndependent Testing:The ProOne G2.0 filter was independently tested multiple times by Envirotek Laboratories, a New Jersey Department of Environmental Protection certified drinking water testing laboratory that is nationally recognized.  ProOne G2.0 filters have been tested in accordance with NSF 42 and 53 stands using NSF protocol.  This is independent testing you can trust, done accurately in a certified lab by experienced professionals. \n\nView ProOne G2.0 Filter Fact Sheet.\nView ProOne G2.0 Detailed Test Results.\nView Envirotek Lab Certificate.\n\nProOne filter elements are available in 5 sizes:\n\nProOne M G2.0 Water Filter Pitcher.  Click HERE to purchase.\nProOne SL G2.0 Slim Line 5\" Filter Element for Scout. Click HERE to purchase. \nProOne 5\" G2.0 for Traveler and Nomad Units\nProOne 7\" G2.0 for Nomad & Big Units\nProOne 9\" G2.0 for King and most other brands\n\nThe ProOne 9\" G2.0 is designed to work with most other brands of gravity fed water filtration units such as Berkey that use a standard 2\" by 9\" filter element.  Now you can upgrade your filters to Propur without needing to purchase a completely new unit.   The new ProOne G2.0 Water & Fluoride filter is a two stage filter. \nSTAGE 1The ProOne G2.0 water filter element features a silver impregnated white ceramic which is designed to remove pathogenic bacteria and cysts, in addition to having exceptional chemical and contaminant removal properties. The majority of pathogenic (disease causing) bacteria and cysts are larger than one micron. The ProOne G2.0 water filter element is controlled so that it will remove cysts greater than 1 micron, and bacteria greater than 0.7 microns.STAGE 2The ProOne G2.0 contains new AquaMetixâ„¢advanced media designed to help reduce or remove heavy metals, arsenic, fluoride, bromine, and others found in drinking water. It also filters radiologicals including Radon 222, Radium, Strontium, Uranium and Vanadium.\nEasy to install, use and clean - no priming required.  The 2.75\" diameter gives you up to 54% more surface area for greater filtration performance compared to other conventional 2\" x 9\" filter elements.  The new ProOne G2.0 Water & Fluoride filter elements are tested to meet NSF/ANSI standards 42, 53 and 61.  In addition to primary contaminants such as pathogenic bacteria and cysts, the ProOne G2.0 Water & Fluoride filter elements help reduce or remove pesticides, herbicides, chloramines (ammonia with chlorine), hydrofluorosilicic acid (the latest form of fluoride not covered by other fluoride filter brands) and sodium hexa fluorosilicate.  Visit the ProOne G2.0 Technical Information Page for more detailed information.Are you looking to purchase an entire system?  Select from below the Propur system equipped with the new ProOne-G2.0 filter that is right for you:\n\nPropur TRAVELER is a 1 filter system, ideal for 1-2 users with 1.6 gal capacity.\nPropur BIG is a 2-3 filter system, ideal for 2-4 users with 2.75 gal capacity.  ProPur's most popular system.\nPropur KING is a 2-4 filter system, ideal for families, business and larger groups with 3.75 gal capacity.\n\nFilter Lifespan*:  The ProOne G2.0 filter elements are good up to 2,400 gallons per pair.  We recommend you replace your ProOne G2.0  (5\", 7\", & 9\") filter elements at least every 12 months.  The ProOne M G2.0 filter for the Propur Water Pitcher should be replaced every 6 months.  The best just keeps getting better!  These latest breakthroughs show why Propur continues to be the industry leader.  Never settling for the status quo, Propur is constantly researching new ways to improve their already industry leading products.  Propur's commitment to innovation is why Alex Jones is proud to partner with them and provide you with the finest gravity fed water filtration systems available.*Filter Lifespans are only on estimate based on normal usage.  Due to the wide variety of contaminants that may be present in your water supply, the length of time the ProOne G2.0 Water & Fluoride filter elements require for replacement and the amount of removal/reduction may vary. Some contaminants may be more easily filtered than others. Percentage of reductions may vary from 50% to 99% over the life of the filters based on the level of contaminant(s).***Propur products ship directly from the manufacturer, separate from other Infowars products you may also order.  Propur reserves the right to use a different shipping method than what is selected during checking out.  Please allow 2-4 weeks for delivery.***"}, {"itemid": "WF-G2-BIG-POG", "subcat": "Propur G2.0 Big 304", "name": "Propur G2.0 Big 304", "img": ["propurking_thumb_1.jpg", "newspigot_solo.jpg", "noslippad.png"], "price": "$103.60", "desc": " Propur Big system equipped with two ProOne G2.0 All-In-One Water & Fluoride Filter Elements.\nProduct Summary:  Propur's most popular system.  The Propur Big is the flagship model and is ideal for a wide range of applications.  Use it in your home, while camping, or in a small office setting.  This dependable and durable water filtration system is also a key part of any emergency preparedness plan.  The Propur Big comes equipped with two ProOne 7\" G2.0 water & fluoride filter elements and has the capability of using three filters.  These new cutting-edge, all-in-one filters removes pathogenic bacterias, fluoride, glyphosate and much more.  This filter does it all, no need to purchase additional fluoride filters.   \n\nRecommended for 2-4 people\n2.75 gallon capacity\nStandard # of filters: 2\nMaximum # of filters: 3\nSize (diameter x height): 9.25\" by 22.5\"  \n\nHow It Works:  Regardless if you are looking for a water purification system to store until events require its use, or whether you are looking for a purification system for daily use, Propur will exceed your needs. Requiring no electricity, simply pour the water to be purified in the top of the unit and it flows through the ProOne G2.0 filters fully purified and ready for drinking. Once you try it, you will not settle for anything less. The Propur Big  gravity fed water filtration system comes with everything you need to get started drinking the best water possible.  \nThe system comes standard with:\n\n\n\nTwo (2) ProOne 7\" G2.0 water & fluoride filter elements.  \n\n\nConstructed of heavy duty ONE piece stainless steel\n\n\nAll metal spigot*\n\n\nIncludes a non-slip base pad\n\n\nWire Stand and 7.5\" Sight Glass Spigot along with additional  ProOne 7\" G2.0 replacement filters are optional upgrades that allow you to optimize your Propur system.  *The new and improved Propur Solid Stainless Steel Spigot now comes standard.  Sleek design, easy to use and install, and built to last.  The new built-in stopping points provide precise on and off positions.  Also, the special shaped rubber washers are designed to create a tight seal and prevent any leaks.  There isn't a better stainless steel spigot in the market and it now comes standard with your purchase of any Propur water filtration unit.About the filter:   The key to any water filtration system is the filter.  The Propur Big comes equipped with two ProOne G2.0 water and fluoride filter elements which are the result of years of research, design, development and innovation.  The new ProOne G2.0 Water & Fluoride filter is a two stage filter that combines silver impregnated self-sterilizing white ceramic with new AquaMetixâ„¢ media for removal of fluoride and other heavy metals, ALL-IN-ONE filter element.  No more add-on fluoride filters that slow down flow rate or hang down into the lower clean water reservoir. There is no other filter like this on the market. Scientifically tested by an independent, 3rd party, certified lab:\n\n\nView ProOne G2.0 Detailed Test Results.\nView ProOne G2.0 Filter Fact Sheet.\nView Envirotek Lab Certificate.\n\n\n \nIn addition to primary contaminants such as pathogenic bacteria and cysts, the ProOne G2.0 Water & Fluoride filter elements help reduce or remove pesticides, herbicides, chloramines (ammonia with chlorine), hydrofluorosilicic acid (the latest form of fluoride not covered by other fluoride filter brands) and sodium hexa fluorosilicate.  Plus the latest test results show the new ProOne G2.0 Water & Fluoride filter removes glyphosate.  More commonly known as Monsanto's Roundup, glyphosate is a very common herbicide used in commercial farming and landscaping.  Glyphosate water contamination is increasing due to the wide-spread use of Roundup in GMO crops.   Protect you and your family from the many unnatural and harmful chemicals found in your water supply with the ProOne G2.0 Water & Fluoride filter. Easy to install, use and clean - no priming required.  The 2.75\" diameter gives you up to 54% more surface area for greater filtration performance compared to other conventional 2\" x 9\" filter elements.  The new ProOne G2.0 Water & Fluoride filter elements are tested to meet NSF/ANSI standards 42, 53 and 61.  Visit the ProOne G2.0 Technical Information Page for further information.Summary: Gravity filtration is the best way to purify your water.  Unlike reverse osmosis or distillation, the Propur filters do not eliminate the beneficial minerals naturally found in water.  Reverse osmosis systems also require an ultraviolet (UV) light to kill bacteria such as e-coli and giardia.  This makes the reverse osmosis systems harder to maintain, less mobile, and dependent upon an electrical source.  Whether for daily use or for emergency preparedness; whether you want to purify river water, well water, pool water, stream water, rainwater, swamp water or simple tap water Propur water purification system is the answer. Propur has taken great care in designing a non-drip spigot and the housing around the filter itself to avoid leakage and defect problems.  Like allPropur products, it is backed by their guarantee of customer satisfaction. **INTERNATIONAL CUSTOMERS:  Please select USPS Priority Mail International to receive correct shipping rate.  International orders without this shipping method selected may be delayed or cancelled.  You may contact Infowars customer service at 1-888-253-3139 or by email at [email protected]/* <![CDATA[ */!function(t,e,r,n,c,a,p){try{t=document.currentScript||function(){for(t=document.getElementsByTagName('script'),e=t.length;e--;)if(t[e].getAttribute('data-cfhash'))return t[e]}();if(t&&(c=t.previousSibling)){p=t.parentNode;if(a=c.getAttribute('data-cfemail')){for(e='',r='0x'+a.substr(0,2)|0,n=2;a.length-n;n+=2)e+='%'+('0'+('0x'+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* ]]> */ if you have any questions.** ***Propur products ship directly from the manufacturer, separate from other Infowars products you may also order. Propur reserves the right to use a different shipping method than what is selected during checking out. Please allow 2-4 weeks for delivery.***"}, {"itemid": "WF-G2-KING-POG", "subcat": "Propur G2.0 King 304", "name": "Propur G2.0 King 304", "img": ["propurking_thumb.jpg"], "price": "$68.94", "desc": " Propur King system equipped with two ProOne G2.0 All-In-One Water & Fluoride Filter Elements.\nProduct Summary:  Propur's largest system.  The Propur King is ideal for families, offices and other high water volume situations.  If you expect to use 3 or more gallons a day, this is the unit for you.  The Propur King includes two ProOne 9\" G2.0 water & fluoride filter elements and has the capability of using up to four filters for faster filtration times.  These new cutting-edge, all-in-one filters removes pathogenic bacterias, fluoride, glyphosate and much more.  This filter does it all, no need to purchase additional fluoride filters.   \n\nRecommended for 2 or more people\n3.75 gallon capacity\nStandard # of filters: 2\nMaximum # of filters: 4\nSize (diameter x height): 10\" by 25.5\"  \n\nHow It Works:  Regardless if you are looking for a water purification system to store until events require its use, or whether you are looking for a purification system for daily use, Propur will exceed your needs. Requiring no electricity, simply pour the water to be purified in the top of the unit and it flows through the ProOne G2.0 filters fully purified and ready for drinking. Once you try it, you will not settle for anything less. The Propur King  gravity fed water filtration system comes with everything you need to get started drinking the best water possible.  The system comes standard with:\n\n\n\nTwo (2) ProOne 9\" G2.0 water & fluoride filter elements.  \n\n\nConstructed of heavy duty ONE piece stainless steel\n\n\nAll metal spigot*\n\n\nIncludes a non-slip base pad\n\n\nWire Stand and 7.5\" Sight Glass Spigot are optional upgrades and can be purchased separately.  *The new and improved Propur Solid Stainless Steel Spigot now comes standard.  Sleek design, easy to use and install, and built to last.  The new built-in stopping points provide precise on and off positions.  Also, the special shaped rubber washers are designed to create a tight seal and prevent any leaks.  There isn't a better stainless steel spigot in the market and it now comes standard with your purchase of any Propur water filtration unit.About the filter:   The key to any water filtration system is the filter.  The Propur King comes equipped with two ProOne G2.0 water and fluoride filter elements which are the result of years of research, design, development and innovation.  The new ProOne G2.0 Water & Fluoride filter is a two stage filter that combines silver impregnated self-sterilizing white ceramic with new AquaMetixâ„¢ media for removal of fluoride and other heavy metals, ALL-IN-ONE filter element.  No more add-on fluoride filters that slow down flow rate or hang down into the lower clean water reservoir.  There is no other filter like this on the market. Scientifically tested by an independent, 3rd party, certified lab:\n\n\nView ProOne G2.0 Detailed Test Results.\nView ProOne G2.0 Filter Fact Sheet.\nView Envirotek Lab Certificate.\n\n\n \nIn addition to primary contaminants such as pathogenic bacteria and cysts, the ProOne G2.0 Water & Fluoride filter elements help reduce or remove pesticides, herbicides, chloramines (ammonia with chlorine), hydrofluorosilicic acid (the latest form of fluoride not covered by other fluoride filter brands) and sodium hexa fluorosilicate.  Plus the latest test results show the new ProOne G2.0 Water & Fluoride filter removes glyphosate.  More commonly known as Monsanto's Roundup, glyphosate is a very common herbicide used in commercial farming and landscaping.  Glyphosate water contamination is increasing due to the wide-spread use of Roundup in GMO crops.   Protect you and your family from the many unnatural and harmful chemicals found in your water supply with the ProOne G2.0 Water & Fluoride filter. Easy to install, use and clean - no priming required.  The 2.75\" diameter gives you up to 54% more surface area for greater filtration performance compared to other conventional 2\" x 9\" filter elements.  The new ProOne G2.0 Water & Fluoride filter elements are tested to meet NSF/ANSI standards 42, 53 and 61.  Visit the ProOne G2.0 Technical Information Page for further information.Summary: Gravity filtration is the best way to purify your water.  Unlike reverse osmosis or distillation, the Propur filters do not eliminate the beneficial minerals naturally found in water.  Reverse osmosis systems also require an ultraviolet (UV) light to kill bacteria such as e-coli and giardia.  This makes the reverse osmosis systems harder to maintain, less mobile, and dependent upon an electrical source.  Whether for daily use or for emergency preparedness; whether you want to purify river water, well water, pool water, stream water, rainwater, swamp water or simple tap water Propur water purification system is the answer. Propur has taken great care in designing a non-drip spigot and the housing around the filter itself to avoid leakage and defect problems.  Like all Propur products, it is backed by their guarantee of customer satisfaction. **INTERNATIONAL CUSTOMERS:  Please select USPS Priority Mail International to receive correct shipping rate.  International orders without this shipping method selected may be delayed or cancelled.  You may contact Infowars customer service at 1-888-253-3139 or by email at [email protected]/* <![CDATA[ */!function(t,e,r,n,c,a,p){try{t=document.currentScript||function(){for(t=document.getElementsByTagName('script'),e=t.length;e--;)if(t[e].getAttribute('data-cfhash'))return t[e]}();if(t&&(c=t.previousSibling)){p=t.parentNode;if(a=c.getAttribute('data-cfemail')){for(e='',r='0x'+a.substr(0,2)|0,n=2;a.length-n;n+=2)e+='%'+('0'+('0x'+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* ]]> */ if you have any questions.** ***Propur products ship directly from the manufacturer, separate from other Infowars products you may also order. Propur reserves the right to use a different shipping method than what is selected during checking out. Please allow 2-4 weeks for delivery.***Enter promo codes in the apply coupon field during check out to receive discount on Propur products.  Only valid at www.infowarsshop.com, not valid with other offers. One use per customer.  Terms and conditions apply, subject to change without notice. "}, {"itemid": "WF-PM-9000", "subcat": "ProPur ProMax Shower Filter w/ massage head", "name": "ProPur ProMax Shower Filter w/ massage head", "img": ["store_propurpurification.jpg"], "price": "$103.60", "desc": " Alex's #1 choice in shower filtration. Reduces and removes over 200 contaminants from shower water, including: heavy metals, VOCs, pesticides, fluoride, chlorine, pharmaceuticals, and odors.\n\n\nTake a shower with the new Propur™ high efficiency ProMax™ shower filter with massage head and experience the difference. Features 4 stage filtration process utilizing new RF water filter element technology. Helps protect your skin from unhealthy effects of contaminants that may be in your water. Independent lab test shows the ProMax™ shower filter helps reduce over 200 contaminants including VOC’s, heavy metals, pesticides, Chloramines, chlorine, fluoride, herbicides, pharmaceuticals and odor. Helps control scale, algae and bacteria. The ProMax™ comes with a triple function swivel massage shower head rated at 2.5 gpm. The ProMax™ is made from ABS plastic and is PBA free. Best operated at 80 psi and 115º F.\n \nUp to 9 month filtration capacity.\n \n**INTERNATIONAL CUSTOMERS:  Please select USPS Priority Mail International to receive correct shipping rate.  International orders without this shipping method selected may be delayed or cancelled.  You may contact Infowars customer service at 1-888-253-3139 or by email at [email protected]/* <![CDATA[ */!function(t,e,r,n,c,a,p){try{t=document.currentScript||function(){for(t=document.getElementsByTagName('script'),e=t.length;e--;)if(t[e].getAttribute('data-cfhash'))return t[e]}();if(t&&(c=t.previousSibling)){p=t.parentNode;if(a=c.getAttribute('data-cfemail')){for(e='',r='0x'+a.substr(0,2)|0,n=2;a.length-n;n+=2)e+='%'+('0'+('0x'+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* ]]> */ if you have any questions.** ***Propur products ship directly from the manufacturer, separate from other Infowars products you may also order. Propur reserves the right to use a different shipping method than what is selected during checking out. Please allow 2-4 weeks for delivery.***\n\n"}, {"itemid": "IWL-PRSFORM-NS-1", "subcat": "ProstaGuard", "name": "ProstaGuard", "img": ["prostaguard_single.jpg", "prosta_guard_label.jpg"], "price": "$103.60", "desc": " Support Your Body Today With ProstaGuard  Men, it's time to get ProstaGuard on your side in naturally supporting your body with our Infowars Life blend of antioxidants and plant-based nutrients.   Infowars Life has set out to bring you formulations that are not only the highest quality out there, but formulas that you can use on a daily basis to give your body the natural herbs and extracts that our experts recommend.  The new ProstaGuard formula does just that, with a blend of saw palmetto, lycopene, plant sterols, zinc, vitamin D3, selenium, copper, and many other key ingredients.  It's something that we have been formulating for a long time, and it's now finally available exclusively through the Infowars Life formulation line. \n \"This is something I take every day, and from my research it's something that men should really be adding to their daily regimen in order to keep their body going at optimal levels.\"  --Alex Jones  \nProstaGuard includes a number of antioxidant and phytonutrients hand selected for their unique abilities, including: \n\nSaw Palmetto: Traditionally used by the American Indians and other cultures to help support the body's natural urinary and reproductive systems, saw palmetto is widely popular throughout Europe and is considered by many to be a staple in alternative therapies. \nVitamin D3: Adequate vitamin D is necessary for healthy tissue in systems of the body including the prostate. \nLycopene: Lycopene is a powerful antioxidant and natural phytochemical that gives fruits and vegetables like tomatoes and watermelon their red color. \nPlant Sterols: Plant sterols, or phytosterols, are natural compounds found in many plants, fruits, vegetables, legumes, and even vegetable oils. \nZinc: An an important trace mineral that is second only to iron when it comes to its concentration within the body. \n\nBegin supporting your body naturally with ProstaGuard today and experience the power of saw palmetto, lycopene, zinc, plant sterols, and the 6 other powerful ingredients in ProstaGuard. "}, {"itemid": "AC-RZM1NB-1", "subcat": "RZ Air Filtration Mask M1 Neoprene", "name": "RZ Air Filtration Mask M1 Neoprene", "img": ["black-neo-v2-front.jpg", "rzmask_thumbnail1.png", "rzmaskcase_thumbnail1.png", "rzmaskcarbon_thumbnail1.png"], "price": "$68.94", "desc": " REGULAR/LARGE  BLACK M1 MASK\nThe M1 Mask is the pioneer of the RZ Vision. A clean, classic look with all the technology you’ve come to expect from RZ Industries. Featuring a durable, 4-way stretch neoprene body that delivers maximum performance in those tough duty situations. Dominating protection and performance through its 99.9% replaceable Active Carbon Filter. The M1 is your multi-purpose, tough-duty air filtration mask.\nFeatures:\nNeoprene Construction – Tough-duty durability 99.9% Replaceable Active Carbon Filters Dual one-way discharge valves – Reduce condensation Adjustable nose clip – Prevent fogging Adjustable Velcro Strap – Universal fit\nFilters tested at Nelson Laboratories, USA\nIncludes:\n\n1 Mask\n2 Filters\n1 Storage bag\n\n \r\n.rzmask {\r\n    -webkit-column-count: 3; /* Chrome, Safari, Opera */\r\n    -moz-column-count: 3; /* Firefox */\r\n    column-count: 3;\r\n\r\n    -webkit-column-gap: 40px; /* Chrome, Safari, Opera */\r\n    -moz-column-gap: 40px; /* Firefox */\r\n    column-gap: 40px;\r\n\r\n    -webkit-column-rule: 2px outset #F3F3F3; /* Chrome, Safari, Opera */\r\n    -moz-column-rule: 2px outset #F3F3F3; /* Firefox */\r\n    column-rule: 2px outset #F3F3F3;\r\n}\r\n\nMASKS WORK GREAT FOR.... \n\r\nAirbrushing |\r\nAllergies |\r\nAthletes |\r\nAuto Body | \r\nBakeries |\r\nCar Racing |\r\nCold Weather Sports |\r\nDog Groomer |\r\nElectricians |\r\nFestivals |\r\nFilm Crews |\r\nFishing |\r\nGardening |\r\nGlass Cutting |\r\nGraffiti Artists |\r\nHome Inspections |\r\nHospitals |\r\nHouse Cleaning | \r\nInsulating |\r\nLandscaping |\r\nMechanics |\r\nNail/Hair Salons |\r\nNurseries |\r\nPainting |\r\nPest Control |\r\nPlumbing |\r\nPottery |\r\nPrint Shops |\r\nRoofing |\r\nSanding |\r\nSanitation |\r\nSewer/Drain Cleaning |\r\nStaining |\r\nTextiles |\r\nTraveling |\r\nTree Trimming |\r\nVeterinarian |\r\nWarehouse |\r\nWelding |\r\nWoodworking |\r\n\n"}, {"itemid": "AC-RZM2MB-1", "subcat": "RZ Air Filtration Mask M2 Mesh", "name": "RZ Air Filtration Mask M2 Mesh", "img": ["black_mesh_front_785b4282-f65b-4ea5-acb3-08edb3629898_1024x1024.png", "rzmask2_thumbnail1.png", "rzmaskcarbon_thumbnail1_1.png", "rzmaskcase_thumbnail1_1.png"], "price": "$103.60", "desc": " REGULAR LARGE M2 MESH FACE MASK\nFreedom of motion through simplicity and innovation. The M2 Mask is unparalleled in its class. It's lightweight and slim design features a full mesh main body construction, resulting in improved airflow and breathability to seamlessly integrate into any users job or adventure. Dominating protection and performance through its 99.9% replaceable Active Carbon Filter. The M2 is your lightweight air filtration mask, ideal for those who stay in motion.\nFeatures:\n\n\nMesh Construction – Lightweight - Breathable\n99.9% Replaceable Active Carbon Filters\nDual one-way discharge valves – Reduce condensation\nAdjustable nose clip – Prevent fogging\nAdjustable Velcro Strap – Universal fit\nVersatile - Durable - Washable\nFilters tested at Nelson Laboratories, USA\n\n\nIncludes:\n\n\n1 Mask\n\n\n2 Filters\n\n\n1 Storage bag\n\n\n \r\n.rzmask {\r\n    -webkit-column-count: 3; /* Chrome, Safari, Opera */\r\n    -moz-column-count: 3; /* Firefox */\r\n    column-count: 3;\r\n\r\n    -webkit-column-gap: 40px; /* Chrome, Safari, Opera */\r\n    -moz-column-gap: 40px; /* Firefox */\r\n    column-gap: 40px;\r\n\r\n    -webkit-column-rule: 2px outset #F3F3F3; /* Chrome, Safari, Opera */\r\n    -moz-column-rule: 2px outset #F3F3F3; /* Firefox */\r\n    column-rule: 2px outset #F3F3F3;\r\n}\r\n\nMASKS WORK GREAT FOR.... \n\r\nAirbrushing |\r\nAllergies |\r\nAthletes |\r\nAuto Body | \r\nBakeries |\r\nCar Racing |\r\nCold Weather Sports |\r\nDog Groomer |\r\nElectricians |\r\nFestivals |\r\nFilm Crews |\r\nFishing |\r\nGardening |\r\nGlass Cutting |\r\nGraffiti Artists |\r\nHome Inspections |\r\nHospitals |\r\nHouse Cleaning | \r\nInsulating |\r\nLandscaping |\r\nMechanics |\r\nNail/Hair Salons |\r\nNurseries |\r\nPainting |\r\nPest Control |\r\nPlumbing |\r\nPottery |\r\nPrint Shops |\r\nRoofing |\r\nSanding |\r\nSanitation |\r\nSewer/Drain Cleaning |\r\nStaining |\r\nTextiles |\r\nTraveling |\r\nTree Trimming |\r\nVeterinarian |\r\nWarehouse |\r\nWelding |\r\nWoodworking |\r\n\n"}, {"itemid": "HR-FDSM", "subcat": "Harvest Right Small Freeze Dryer", "name": "Harvest Right Small Freeze Dryer", "img": ["03-small-aqua-dimensions.png", "03-small-stainless_1.png", "03-small-satinwhite_1.png"], "price": "$103.60", "desc": " Harvest Right Freeze Dryer - Small\nThis patented technology has the capability of freeze drying 1.0 to 1.5 gallons (1.0 to 1.5 #10 cans) per 24-hour batch. In a year’s time, you can easily freeze dry  240 gallons of food. All of which will keep nearly 100% of its nutrition.\n\nEasy to use. Just press start and the freeze dryer will beep when finished.\nStandard 110 Volt\nPreserve food for up to 25 years with your own freeze dryer\nPerfect for freeze-drying fruits, vegetables, meats, dairy products, meals, desserts, and more\n\nSmall Harvest Right Freeze Dryer includes:\n\nFreeze Dryer\nCommercial Grade Vacuum Pump\nThree (3) Stainless Steel Trays\nOwner’s Manual\nDimensions: 25” Tall x 16.5” Wide x 18.5” Deep – perfect for a countertop, cart, or table\n\n \n\n \nThis image shows both the freeze dryer and the vacuum pump together. This is part of the complete solution that everyone receives when they purchase a freeze dryer.\nThe following description illustrates how the components shown here (freeze dryer and vacuum pump) work to freeze dry food:\n\nThe process is simple. The food freezes to an ultra cold temperature. The chamber the food is in becomes a vacuum and the water evaporates out of the food.\nThe process is automatic. The person using the freeze dryer simply presses “Start” and the process runs to completion.\nIt doesn’t matter what one puts in the freeze dryer. There can be pineapple on one shelf, turkey on another, yogurt on a third, and a leftover meal (like chili or stroganoff) on the last shelf.\n\n\nPRICE INCLUDES SHIPPING TO THE CONTIGUOUS UNITED STATES.  NO INTERNATIONAL ORDERS. ADDITIONAL SHIPPING CHARGE REQUIRED FOR ORDERS BEING SHIPPED TO ALASKA OR HAWAII.  To ensure quality and to reduce costs, this item ships directly from the supplier. We reserve the right to use a shipping method that is different than what is selected during checkout."}, {"itemid": "HR-FDS", "subcat": "Harvest Right Standard Freeze Dryer", "name": "Harvest Right Standard Freeze Dryer", "img": ["02-standard-red-dimensions.png", "02-standard-black_1.png", "02-standard-aqua_1.png", "02-standard-satinwhite_1.png", "02-standard-yellow_1.png", "02-standard-stainless_1.png"], "price": "$68.94", "desc": "  Freeze Dryer - Standard\nThis patented technology has the capability of freeze drying 1.5 to 2.5 gallons (1.5 to 2.5 #10 cans) per 24-hour batch. In a year’s time, you can easily freeze dry  380 gallons of food. All of which will keep nearly 100% of its nutrition.\n\nEasy to use. Just press start and the freeze dryer will beep when finished.\nStandard 110 Volt\nPreserve food for up to 25 years with your own freeze dryer\nPerfect for freeze-drying fruits, vegetables, meats, dairy products, meals, desserts, and more\n\nStandard Harvest Right Freeze Dryer includes:\n\nFreeze Dryer\nCommercial Grade Vacuum Pump\nFour(4) Stainless Steel Trays\nOwner’s Manual\nDimensions: 30” Tall x 20” Wide x 25” Deep – perfect for a countertop, cart, or table\n\n \n\n \nThis image shows both the freeze dryer and the vacuum pump together. This is part of the complete solution that everyone receives when they purchase a freeze dryer.\nThe following description illustrates how the components shown here (freeze dryer and vacuum pump) work to freeze dry food:\n\nThe process is simple. The food freezes to an ultra cold temperature. The chamber the food is in becomes a vacuum and the water evaporates out of the food.\nThe process is automatic. The person using the freeze dryer simply presses “Start” and the process runs to completion.\nIt doesn’t matter what one puts in the freeze dryer. There can be pineapple on one shelf, turkey on another, yogurt on a third, and a leftover meal (like chili or stroganoff) on the last shelf.\n\nHOW IT WORKS\n<!--\r\n@import url(https://fonts.googleapis.com/css?family=Source+Sans+Pro);\r\n@import url(https://fonts.googleapis.com/css?family=Teko:700);\r\n.snip1563 {\r\n  background-color: #fff;\r\n  color: #ffffff;\r\n  display: inline-block;\r\n  font-family: 'Source Sans Pro', sans-serif;\r\n  font-size: 12px;\r\n  margin: 1px 5px;\r\n  max-width: 215px;\r\n  min-width: 200px;\r\n  overflow: hidden;\r\n  position: relative;\r\n  text-align: right;\r\n  width: 100%;\r\n}\r\n\r\n.snip1563 *,\r\n.snip1563 *:before,\r\n.snip1563 *:after {\r\n  -webkit-box-sizing: border-box;\r\n  box-sizing: border-box;\r\n  -webkit-transition: all 0.45s ease;\r\n  transition: all 0.45s ease;\r\n}\r\n\r\n.snip1563 img {\r\n  backface-visibility: hidden;\r\n  max-width: 100%;\r\n  vertical-align: top;\r\n}\r\n\r\n.snip1563:before,\r\n.snip1563:after {\r\n  position: absolute;\r\n  top: 0;\r\n  bottom: 0;\r\n  left: 0;\r\n  right: 0;\r\n  content: '';\r\n  background-color: #10335C;\r\n  opacity: 0.5;\r\n  -webkit-transition: all 0.45s ease;\r\n  transition: all 0.45s ease;\r\n}\r\n\r\n.snip1563:before {\r\n  -webkit-transform: skew(70deg) translateX(80%);\r\n  transform: skew(30deg) translateX(80%);\r\n}\r\n\r\n.snip1563:after {\r\n  -webkit-transform: skew(-30deg) translateX(70%);\r\n  transform: skew(-50deg) translateX(60%);\r\n}\r\n\r\n.snip1563 figcaption {\r\n  position: absolute;\r\n  top: 0px;\r\n  bottom: 0px;\r\n  left: 0px;\r\n  right: 0px;\r\n  z-index: 1;\r\n  bottom: 0;\r\n  padding: 20px 20px 20px 40%;\r\n}\r\n\r\n.snip1563 figcaption:before,\r\n.snip1563 figcaption:after {\r\n  position: absolute;\r\n  top: 0;\r\n  bottom: 0;\r\n  left: 0;\r\n  right: 0;\r\n  background-color: #10335C;\r\n  box-shadow: 0 0 20px rgba(0, 0, 0, 0.7);\r\n  content: '';\r\n  opacity: 0.5;\r\n  z-index: -1;\r\n}\r\n\r\n.snip1563 figcaption:before {\r\n  -webkit-transform: skew(30deg) translateX(100%);\r\n  transform: skew(30deg) translateX(100%);\r\n}\r\n\r\n.snip1563 figcaption:after {\r\n  -webkit-transform: skew(-30deg) translateX(90%);\r\n  transform: skew(-30deg) translateX(90%);\r\n}\r\n\r\n.snip1563 h3,\r\n.snip1563 p {\r\n  margin: 0;\r\n  opacity: 0;\r\n  letter-spacing: 1px;\r\n}\r\n\r\n.snip1563 h3 {\r\n  font-family: 'Teko', sans-serif;\r\n  font-size: 36px;\r\n  font-weight: 700;\r\n  line-height: 1em;\r\n  text-transform: uppercase;\r\n}\r\n\r\n.snip1563 p {\r\n  font-size: 0.9em;\r\n}\r\n\r\n.snip1563 a {\r\n  position: absolute;\r\n  top: 0;\r\n  bottom: 0;\r\n  left: 0;\r\n  right: 0;\r\n  z-index: 1;\r\n}\r\n\r\n.snip1563:hover h3,\r\n.snip1563.hover h3,\r\n.snip1563:hover p,\r\n.snip1563.hover p {\r\n  -webkit-transform: translateY(0);\r\n  transform: translateY(0);\r\n  opacity: 0.9;\r\n}\r\n\r\n.snip1563:hover:before,\r\n.snip1563.hover:before {\r\n  -webkit-transform: skew(30deg) translateX(30%);\r\n  transform: skew(30deg) translateX(30%);\r\n  -webkit-transition-delay: 0.05s;\r\n  transition-delay: 0.05s;\r\n}\r\n\r\n.snip1563:hover:after,\r\n.snip1563.hover:after {\r\n  -webkit-transform: skew(-30deg) translateX(20%);\r\n  transform: skew(-30deg) translateX(20%);\r\n}\r\n\r\n.snip1563:hover figcaption:before,\r\n.snip1563.hover figcaption:before {\r\n  -webkit-transform: skew(30deg) translateX(50%);\r\n  transform: skew(30deg) translateX(50%);\r\n  -webkit-transition-delay: 0.15s;\r\n  transition-delay: 0.15s;\r\n}\r\n\r\n.snip1563:hover figcaption:after,\r\n.snip1563.hover figcaption:after {\r\n  -webkit-transform: skew(-30deg) translateX(40%);\r\n  transform: skew(-30deg) translateX(40%);\r\n  -webkit-transition-delay: 0.1s;\r\n  transition-delay: 0.1s;\r\n}\r\n-->\n \nsTEP 1\nFresh or cooked foods are placed in the dryer where they are frozen to -40 degrees Fahrenheit or colder.\n\n \nsTEP 2\nOnce the food is frozen, the freeze dryer creates a powerful vacuum around the food. Then, as the food is slightly warmed, the ice transitions into vapor and evaporates.\n\n \nStep 3\nThe freeze-dried food is then sealed in moisture and oxygen-proof packaging (Mylar bags, mason jars, or cans) along with an oxygen absorber to ensure freshness until opened.\n\n \nStep 4\nWhen water is added to the food it regains its original fresh flavor, aroma, and appearance!\n\n\nPRICE INCLUDES SHIPPING TO THE CONTIGUOUS UNITED STATES.  NO INTERNATIONAL ORDERS. ADDITIONAL SHIPPING CHARGE REQUIRED FOR ORDERS BEING SHIPPED TO ALASKA OR HAWAII.  To ensure quality and to reduce costs, this item ships directly from the supplier. We reserve the right to use a shipping method that is different than what is selected during checkout."}, {"itemid": "IWL-SMV-1", "subcat": "Super Male Vitality", "name": "Super Male Vitality", "img": ["sm-thumbnail.jpg", "thumbnail.jpg"], "price": "$68.94", "desc": " \nThe All New and Advanced Super Male Vitality\nThis updated formula incorporates the newest technology in herbal extraction methods with even more powerful concentrations of various herbs and extracts that have been designed to now be stronger than ever before. It's the Super Male you've been taking, with an extra punch. \n\nAlso Available: Super Female Vitality\n\nAfter reviewing the individual herbal components in the original Super Male Vitality, we decided we could enhance the potency by using higher concentrations of some herbs while lowering the concentrations of other herbs.  We also advanced our extraction technology to stabilize more of the active plant compounds and essential oils without oxidation, in order to enhance the natural support and strength of Super Male Vitality by a considerable amount.The new Super Male Vitality also contains fulvic acid, which works to carry the individual components of the herbs deep into the body while also providing powerful benefits to the bioavailability of the finished extract. \nIntroducing Super Male Vitality\nAs men age, they may often experience a slow-down in vitality, energy, and overall wellness. Super Male Vitality is specifically designed to assist the body in regulating proper balance to create superior vitality in males, and has been used by Alex Jones in order to maximize vitality when working up to 12 hours a day or more in the fight for freedom. \n\"When I spoke to Dr. Edward Group about formulating a male vitality formula, I was excited about the idea of what it could do for me. Folks, let me tell you, this product works so well for me that I actually had to stop taking it before I go on air or else I would want to do hours and hours of overdrive with complete focus on the topics at hand.\nThere's no question that Super Male Vitality really works for me, and there's a reason that the entire process took more than 5 years to develop. Other products are priced way higher that claim to boost your vitality, yet they still may contain additives, fillers, you name it. The key with Super Male Vitality and all of the other products under Infowars Life has always been to never sacrifice on quality while still offering it at an even lower price than many of the products that are loaded with low quality ingredients. This is literally an infusion of the highest quality sources and naturally derived essences. I only bring the best formulations and products to my listeners, and Super Male Vitality has passed all of my expectations.\" - Alex Jones\nWhat are the Health Benefits of Super Male Vitality?\n\nSuper Male Vitality is designed to aid the body in ways that may help support normal testosterone levels in men.\nSuper Male Vitality features a unique formula that is completely free of GMOs (genetically modified ingredients), harmful additives, gluten, and is made right here in the USA.\nSuper Male Vitality is the only Spagyrex processed male vitality support product on the market.\nPromotes your body's own natural responses and does not use synthetic chemicals. \n\nThe Invention of Super Male Vitality\nSuper Male Vitality is the result of ancient wisdom reinterpreted over several years in the light of modern equipment and analysis.\nThe history of Super Male Vitality is based on the proprietary Spagyrex process, which was invented during extensive research on the numerous biological deficiencies that males may experience after they age.\nThis led researcher Dr. Group on a six year journey to create the most powerful herbal male hormonal support product on the market. It all started by studying a combination of herbs that have been traditionally understood to enhance and regulate the body as well as the works of the most famous 16th century healer, scientist and formulator, Paracelsus.\nParacelsus originally composed the word Spagyria (Spagyry), which means to extract (spao) and combine (ageiro). The word was used to describe the process and power of turning a preparation of herbs into a liquid formula dedicated to enhancing health. \nThis original technology was taken and advanced by using the science of modern day technology.\nThe Spagyrex process used in Infowars Life products combines ancient and current technologies to create a revolutionary, multi-step, proprietary herbal formula technique that does not chemically change the natural ingredients. This follows the principle of separating and recombining all the elements of an herb, to extract the most powerful essence of its healing nature. \nSuper Male Vitality Ingredients:\nPlease note: while these Asian and South American herbs have been available individually in specialty herb shops in the United States for decades, we have brought them together in a unique combination for you.\nTribulus terrestris (fruit)\nTribulus terrestris is a vigorous plant integrated into the Super Male Vitality.  Numerous benefits regarding vitality are attributed to the plant by men worldwide. \nSuma (root)\nSuma is a ground vine with deep roots. It is native to the Amazon and other parts of South America. Suma has been in use for nearly 300 years. It's even been called \"the Russian Secret\" due to its use by Russian athletes.\nAshwaganda (root)\nBetter known as Indian ginseng, ashwaganda has been traditionally used in Ayurvedic medicine as a key ingredient that may help to enhance energy and mental function.\nMaca (root)\nMaca, or Peruvian ginseng, is a vigorous plant that grows atop the Andes. Maca was made popular by indigenous tribes in Peru who have used the root for purposes of vitality for quite some time.\nAvena sativa (root)\nAlso known as the common oat, avena sativa contains natural compounds that may help support normal response in men.\nTongkat ali (root)\nTongkat ali, or Malaysian ginseng, is traditionally held to support a number of natural functions in men.\nCatuaba (bark)\nNative to the Amazon, catuaba is a small, flowering tree. Its bark was discovered by the Tupi tribe and described as having qualities that may aid in male vitality. \nMuira puama (bark)\nMuira puama is a small tree native to the Amazon. Practitioners of Brazilian herbal medicine reportedly use muira puama bark.\nFulvic acid\n \nAdditional Tips for Vitality\nReduce the stress in your life. Stress can make you feel fatigued, mentally bogged down, and affect your vitality on numerous levels.  Healthy and natural levels are supported best by a healthy body. Exercise and cleanse your body regularly.\n**Sign up with our new Auto-Ship program and protect yourself against supply shortages.  As you know, due to the high quality and hard to find ingredients in our Infowar Life products, we periodically run out of inventory.  The Auto-Ship feature guarantees you'll receive your product as we always hold back enough inventory for Auto-Ship customers.  Secure your supply today!   \nINTERNATIONAL CUSTOMERS: Please check with your country's customs office regarding the import of the products you wish to order.  As the buyer, you are solely responsible for any import restrictions, prohibited import items, taxes, tariffs, fees and other duties.   In many countries, including Canada and Australia, supplements are restricted for import to a 90-day supply and must be for your own personal use. Losses incurred due to exceeding your country's limitations will not be refunded.  Visit the International Customers Guide for more information.\n Super Male Vitality now ships from a separate warehouse via USPS. You will receive an email once a shipping label has been created for your order.\n\n "}, {"itemid": "SP-IWL-SBLUE-BUBGUM-5PK", "subcat": "Superblue Fluoride-Free Toothpaste: Bubble Gum - 5 Pack", "name": "Superblue Fluoride-Free Toothpaste: Bubble Gum - 5 Pack", "img": ["bubblegum5.jpg", "bubblegumtoothpasteback_2.jpg"], "price": "$103.60", "desc": " ALL NEW! Bubble Gum Flavored Toothpaste \nIntroducing Superblue Fluoride-Free Bubble Gum Flavored Toothpaste  by Infowars Life™, the groundbreaking toothpaste that features natural oils and ingredients used since Aboriginal and Biblical times to supercharge good oral health and fresh breath. \nA Groundbreaking Fluoride-Free Formula \nInstead of containing fluoride, Super Blue Fluoride-Free Toothpaste™ is loaded with 'the good halogen' iodine and an array of other beneficial compounds that have been hand-selected for their oral health benefits. \nIn working with our team of dentists and formulation scientists, it was essential that Super Blue Fluoride-Free Toothpaste™ contained these natural ingredients:\nXylitol – Championed by many oral health experts worldwide, xylitol may help support the natural health and normal remineralization of teeth. Low levels of xylitol are found naturally in the fibers of some fruits and vegetables like berries and mushrooms. \nNano Silver – Every tube of Infowars Life™ Super Blue Fluoride-Free Toothpaste™ is infused with high quality nano silver.\nIodine – In addition to its role as an essential mineral that supports thyroid health and well-being, iodine was specifically chosen by our team of dental experts as one of the primary ingredients in Super Blue Fluoride-Free Toothpaste™ for its many benefits in supporting good oral health. \nBetaine – Derived naturally from beets, betaine is also known as trimethylglycine (TMG) and helps the body metabolize  an amino acid called homocysteine. Our dental experts hand picked betaine for its many notable functions in supporting natural health. \n \n "}, {"itemid": "IWL-SBLUE-BUBGUM-1", "subcat": "Superblue Fluoride-Free Toothpaste: Bubble Gum", "name": "Superblue Fluoride-Free Toothpaste: Bubble Gum", "img": ["bubblegum1.jpg", "bubblegumtoothpasteback_4.jpg"], "price": "$68.94", "desc": " ALL NEW! Bubble Gum Flavor Toothpaste \nIntroducing Superblue Fluoride-Free Toothpaste by Infowars Life™, the groundbreaking toothpaste that features natural oils and ingredients used since Aboriginal and Biblical times to supercharge good oral health and fresh breath. \nA Groundbreaking Fluoride-Free Formula \nInstead of containing fluoride, Super Blue Fluoride-Free Toothpaste™ is loaded with 'the good halogen' iodine and an array of other beneficial compounds that have been hand-selected for their oral health benefits. \nIn working with our team of dentists and formulation scientists, it was essential that Super Blue Fluoride-Free Toothpaste™ contained these natural ingredients:\nXylitol – Championed by many oral health experts worldwide, xylitol may help support the natural health and normal remineralization of teeth. Low levels of xylitol are found naturally in the fibers of some fruits and vegetables like berries and mushrooms. \nNano Silver – Every tube of Infowars Life™ Super Blue Fluoride-Free Toothpaste™ is infused with high quality nano silver.\nIodine – In addition to its role as an essential mineral that supports thyroid health and well-being, iodine was specifically chosen by our team of dental experts as one of the primary ingredients in Super Blue Fluoride-Free Toothpaste™ for its many benefits in supporting good oral health. \nBetaine – Derived naturally from beets, betaine is also known as trimethylglycine (TMG) and helps the body metabolize  an amino acid called homocysteine. Our dental experts hand picked betaine for its many notable functions in supporting natural health. \n \n "}, {"itemid": "SC-SSV-MPS-1", "subcat": "Survival Seed Vault", "name": "Survival Seed Vault", "img": ["03.jpg", "01.jpg", "02.jpg"], "price": "$103.60", "desc": " The Organic Seed Vault from Patriot Seeds gives you a cornucopia of variety to grow your own food year-after-year. Ideal for this year’s garden or for the seasons to come!\nInside our sturdy can, you’ll find 21 100% heirloom organic seed varieties suited for almost any growing region. These 21 vegetables, fruits and herbs provide an excellent source of nutrients for a well-balanced diet. Each seed variety is individually-sealed in military-grade Mylar to remove air and moisture. This lets you store your seeds for five years - even longer at cooler temperatures below 75 F.\n \n\n21 Easy-to-Grow Seed Varieties\nUSDA Certified Organic, Made in the USA\n100% Heirloom Seeds, Non-hybrid and Non-GMO\nSealed in Military-Grade Mylar for Long-Term Storage (5+years)\nVegetable Growing and Seed-saving Guide Included\n\n \r\nWhat’s Inside the Organic Seed Vault:\n\nBlue Lake Bush Bean (30G)\nCalifornia Wonder Sweet Pepper (250MG)\nMarketmore 76 Cucumber (2G)\nNantes Carrots (250MG)\nParis Island Cos Romaine Lettuce (500MG)\nGolden Acre Cabbage (1G)\nDetroit Dark Red Beet (2.5G)\nCascadia Pea (14G)\nCalifornia Light Red Kidney (28G)\nBeefsteak Tomato (250MG)\nCherry Belle Radish (4G)\nGreen Sprouting Calabrese Broccoli (500MG)\nWaltham Butternut Winter Squash (5G)\nBloomsdale Spinach (3G)\nYellow Sweet Spanish Onion (250MG)\nRoma Tomato (250MG)\nHales Best Jumbo Melon (1G)\nSnowball Cauliflower (1G)\nBlack Beauty Summer Squash (4G)\nSugar Baby Watermelon (2G)\nStandard Chives (500MG)\n\n\n\nPatriot Seeds is a premium organic heirloom seed supplier based in the United States. Our passion for liberty and self-reliance has driven our desire to help others grow their own food. Join us and millions of others – declare your food independence today!\nInternational Customers: Import laws vary from country to country. Please consult your government's laws and regulations regarding seed importation. INFOWARS SHOP is not responsible for any delays, quarantines, fees, penalties or destruction of product resulting from the attempt to ship seeds out of the United States. "}, {"itemid": "IWL-SSX2-1", "subcat": "Survival Shield X-2 - Nascent Iodine", "name": "Survival Shield X-2 - Nascent Iodine", "img": ["x-2_40_percent_off.jpg", "x2_label.jpg"], "price": "$68.94", "desc": " \nInfowars Life Survival Shield X-2 Is Now AvailableLeading the way into the next generation of super high quality nascent iodine, the new Infowars Life Survival Shield X-2 is now here. New Stronger Formula From 7,000 Feet Below The SurfaceDerived from 200 million year old salt solutions found more than 7,000 feet below the Earth's surface, the next level of Survival Shield is now here and much stronger than our original formula with a powerful 650 micrograms per single drop.Experience the benefits of next level proprietary nascent iodine, developed using our Thermodynamic Pressure Sensitive High Energy Sound Pulse Nano-Emulsion Technology that allows for a highly unique nascent iodine that is both concentrated and free of unwanted additives and genetically modified ingredients.  We even pre-screen our Survival Shield X-2 iodine for radiation during our quality control phase. The Top 5 Reasons You Need Nascent Iodine \n\nIodine is an essential mineral that supports thyroid health and well-being.  \nNascent iodine may support healthy iodine levels.  \nNascent iodine may support healthy hormone levels.  \nNascent iodine may be involved in maintaining healthy metabolism.\nSupplementing with pure nascent iodine may provide sufficient iodine so that the body does not need to absorb iodine from other, perhaps less pure, sources.\n\nSurvival Shield X-2 QualitySurvival Shield X-2 is manufactured in a state-licensed facility that meets federal regulatory standards, is cGMP/HACCP-compliant, and lab grade. Raw elemental iodine is a controlled substance both at a State and Federal level. The licensing, approvals and regulatory documentary procedures are exacting and costly.Bound forms of iodine must first be separated, clarified and purified from other binding components or impurities into a USP-grade (United States Pharmaceutical), mono-elemental iodine as certified USP resublimated iodine crystals. In this purified crystal form, iodine is a highly reactive and toxic substance. However, when the purified USP iodine crystals are subjected to a proprietary process it becomes nano-colloidalized and transforms into a form of elemental nascent iodine, also referred to as monoatomic iodine, without the addition of iodides!Shocking Statistics About Iodine\n\nAccording to the World Health Organization's Department of Nutrition for Health and Development, iodine deficiency is a public health problem in 54 countries.\nThe CDC states that iodine deficiency is one of the four major deficiency diseases in the world (Fortunately, it is the easiest to correct).\nThe 2013 USGS iodine commodity summary warns that there are no comparable substitutes for iodine.\nInformation published by UNICEF notes that iodine deficiency is the most avoidable cause of stunted physical and intellectual development.\n\nWhat Are The Health Benefits Of Nascent Iodine?\n\nProper iodine levels may provide support for normal response to environmental and dietary toxins.\nSupports thyroid health.\nMay support breast milk production and quality.\n\n Why Is Survival Shield X-2 The Best Nascent Iodine Available?\n\nSurvival Shield X-2 is created from salt solutions found more than 7,000 feet below the Earth's surface. \nIt is tested for radiation by our quality control experts before being placed for sale. \nIt is approximately 50% stronger than our original Survival Shield formulation. \nIt is a true glycerite of natural USP grade iodine\nThe nascent iodine in Survival Shield X-2 is not subjected to direct heat, harsh chemicals, or alcohol.\nThe transformative process produces a stable product that no other brand can match!\nCompletely non-GMO certified.\nVegan-friendly and completely non-toxic.\nIt provides high elemental iodine uptake.\nContains NO inefficient iodides.\nDoes not sting or burn.\n\nIMPORTANT SHIPPING INFORMATION: International Customers, please check with your country's customs office regarding the import of the products.  As the buyer, you are solely responsible for any import restrictions, prohibited import items, taxes, tariffs, fees and other duties.\nSurvival Shield X-2 now ships from a separate warehouse via USPS. You will receive an email once a shipping label has been created for your order.\nThese statements have not been evaluated by the Food and Drug Administration.  This product is not intended to diagnose, treat, cure or prevent any disease.\nTestimonials represent a cross section of the range of results that appear to be typical with these products. Results may vary depending upon use and commitment."}, {"itemid": "CZ-ABI", "subcat": "The Aegis Armored Backpack Insert", "name": "The Aegis Armored Backpack Insert", "img": ["aegisbackpackinserts.jpg", "aegisbackpackinsert.jpg"], "price": "$68.94", "desc": " Carbon NanoTube Technology Body Armor\n\nThe Aegis™ armor insert is all you need to turn any backpack into a full armor system. Harnessing the ballistic potential of carbon nanotubes has made our armor the lightest, flexible armor available anywhere. Less expensive than insurance and even better protection, the Aegis protects you from active shooters and bomb threats. You won’t even notice the lightweight, flexible armor covering your vitals. Give yourself a bulletproof peace of mind.\nThe armor insert is only 1/4 inch thick and weighs about a pound so you’ll forget you have it until you need it. The Aegis offers unprecedented, long-lasting protection which also works great for college backpacks and business briefcases. Our armor has been tested to NIJ standards and will protect you for years to come, 20 years to be precise, and we back that up with a warranty.\n\nStops .22 LR, .380, 9mm, .40 Cal, .45 ACP, and .357 Mag\nAreal Density: .79 lbs/sq. ft.\nCarbonNT – carbon nanotube technology\n20 Year Shelf Life\nWaterproof\nMaximum Shock Absorption = less back face deformation\nStab Resistance to 20 PSI\nShrapnel Resistant            \n\nSIZE CHART\n\n\n \nHeight (Inches)\nWidth (Inches)\n\n\nSMALL\n9.5\"\n7\"\n\n\nMEDIUM\n13\"\n10\"\n\n\nLARGE\n15\"\n11\"\n\n\n\n* * * CANNOT BE SHIPPED TO CONNECTICUT OR OUTSIDE OF THE U.S. | PLEASE ALLOW 4-6 WEEKS FOR SHIPPING * * *"}, {"itemid": "BK-CWOW-RS-1", "subcat": "The Clintons' War On Women", "name": "The Clintons' War On Women", "img": ["clinton-front.jpg", "clinton-back.jpg"], "price": "$103.60", "desc": "    In this groundbreaking book, New York Times bestselling author Roger Stone and researcher and alternative historian Robert Morrow map the arc of Bill and Hillary’s crimes and cover-ups. They reveal details about their actions in Arkansas, during Bill Clinton’s time in the White House, about who really ordered the deadly attack on the Branch Davidian compound in Waco, during Hillary’s tenure as secretary of state, about their time at the Clinton Foundation, and during Hillary’s current campaign for president.\r\n\r\nThis is the first book to shed light on the couple’s deeply personal violations of the people they crushed in their obsessive quest for power. Along the way, Stone and Morrow reveal the family’s darkest secrets, including a Clinton family member’s drug rehab treatment that was never reported by the press, Hillary Clinton’s unusually close relationship with a top female aide, and a stunning revelation of such impact that it could strip Bill Clinton of his current popularity and derail Hillary’s push to be the second Clinton in the White House.\r\n\r\nAnyone who cares about the future of the United States will want to read this tell-all, exposing the appalling, unvarnished, and ugly truth about the Clintons"}, {"itemid": "BK-MOTP-RS-1", "subcat": "The Making of The President", "name": "The Making of The President", "img": ["the_making_of_a_president.png", "making_of_the_president_back.png"], "price": "$103.60", "desc": " A Message From The Author\n\nThe Making of the President 2016 reveals how Trump brilliantly picked at Hillary Clinton’s weaknesses, particularly her reputation as a crooked insider, and ignited the passions of out-of-work white men and women from the rust belt and beyond, at a time when millions of Americans desperately wanted change. Stone also reveals how and why the mainstream media got it wrong, including how the polls were loaded and completely misunderstood who would vote.\nStone, a long time Trump retainer and confidant, gives us the inside story of how Donald Trump almost single-handedly harnessed discontent among “Forgotten Americans” despite running a guerrilla-style grass roots campaign to compete with the smooth running and free-spending Clinton political machine.\nStone's analysis is akin to Theodore H. White’s seminal book The Making of the President 1960. It is both a sweeping analysis of the trends that elected Trump as well as the war stories of a hard-bitten political survivor who Donald Trump called “one tough cookie.\"\nAbout The Author\nHost of the Stone Cold Truth show, Roger Stone is a seasoned political operative and pundit. A veteran of nine national presidential campaigns, he served as a senior campaign aide to three Republican presidents. An outspoken libertarian, he is the author of the New York Times bestseller “The Man Who Killed Kennedy: The Case Against LBJ” and has written for Fox Opinion, Breitbart News, StoneZone.com, the Daily Caller and the Op-Ed page of the New York Times. A well-known voice in politics for over forty years, Roger Stone often gives insights on behind-the-scenes political agendas on Fox News and InfoWars. A long-time friend and former advisor to President-elect Donald Trump, Roger Stone has been banned by CNN and MSNBC for his outspoken and \"politically incorrect\" criticism of Bill and Hillary Clinton. Follow him at StoneColdTruth.com\n*Please note that these books are no longer signed copies. That promotion has ended.*"}, {"itemid": "SP-SRBKDVD-1", "subcat": "The Strategic Relocation DVD & Book Special", "name": "The Strategic Relocation DVD & Book Special", "img": ["strategic-relocation-dvdbook_oct26.jpg"], "price": "$103.60", "desc": " Anticipate the collapse.  The Strategic Relocation DVD & Book Special provides the most comprehensive and current information about how to prepare for the upcoming collapse.  Joel Skousen's original Strategic Relocation: North American Guide To Safe Places Book is the go to resource for all the important information about where to be and how to prepare for a societal collapse.  In the Alex Jones produced documentary Strategic Relocation Documentary Film Featuring Joel Skousen, Alex Jones and Joel Skousen present an in-depth discussion about the original book along with other important preparedness strategies. "}, {"itemid": "CZ-TS", "subcat": "The T Shield Concealed Body Armor", "name": "The T Shield Concealed Body Armor", "img": ["t-shield_carrier_front.png", "t-shield_carrier.png", "tshieldwhitefront1200.jpg", "tshieldblackfront1200.jpg"], "price": "$103.60", "desc": " Carbon NanoTube Technology Body Armor\n\n\n\nThe T-Shield answers the demands for a completely concealable armor system. By harnessing the potential of carbon nanotubes we have produced the lightest, strongest, flexible body armor on the market. The T-Shield discreetly covers the vitals, front and back (heart, lungs, liver, kidneys). Only 1/4″ thick, the armor can be concealed by almost any clothing. Ahead of its time, this armor system also comes with our formidable 20-year warranty.\nThe Citizen Armor inserts work in conjunction with a compression shirt which molds the armor to the body. The amazing shock absorption of our armor means less kinetic energy makes it through, or, in technical terms, less back face deformation.\nClick here to view the sizing chart for Citizen Armor.\nDetails:\n\nAreal density .79 lbs/sq. ft.\nCarbonNT – carbon nanotube technology\nRemovable armor shields/washable outer layer\n20-year shelf life\nWaterproof\nAntimicrobial\nMaximum shock absorption= less BFD\nShrapnel resistance\nStab resistance up to 20 PSI\nMade in the U.S.A.\n\n* * * CANNOT BE SHIPPED TO CONNECTICUT OR OUTSIDE OF THE U.S.  |  PLEASE ALLOW 4-6 WEEKS FOR SHIPPING* * *"}, {"itemid": "DVD-TUS-SQ-1", "subcat": "True Legends - The Unholy See", "name": "True Legends - The Unholy See", "img": ["true-legends-front-thumbnail.jpg", "true-legends-back-thumbnail.jpg"], "price": "$103.60", "desc": " This full length feature film is packed with explosive content, including: testimony from an active duty pilot who handled and transported the body of a dead giant killed by U.S. Military operatives in the caves of Afghanistan; evidence of a vast subterranean world hidden beneath the surface of the earth; further proof that the megaliths belonged to the Pre-Flood Age; never-before revealed information concerning Zecharia Sitchin and the Anunnaki; and the unmasking of the Church of Rome, and the Vatican’s secret plan to resurrect the Golden Age and welcome from heaven the return of the ancient gods. From Cusco, Peru; to Rome, Italy; to the island of Malta; join Timothy Alberino and the GenSix Production crew as they follow the path of a conspiracy that gives credence to the old adage… all roads lead to Rome!\n \n"}, {"itemid": "TS-TP2020", "subcat": "Trump Pence 2020 Battle Cry Shirt", "name": "Trump Pence 2020 Battle Cry Shirt", "img": ["trumppenceshirtfront.jpg", "trumppenceshirtback.jpg"], "price": "$68.94", "desc": " Trump Pence 2020 Battle Cry Shirt\nShow the globalists your continued support for Trump and Pence for re-election in 2020! "}, {"itemid": "VO-VRDOT", "subcat": "Vortex Venom Red Dot", "name": "Vortex Venom Red Dot", "img": ["rd_venom_3moa_fl-t.jpg", "rd_venom_3moa_fr-t.jpg", "rd_venom_3moa_br-t.jpg", "rd_venom_3moa_ar-mount-t.jpg"], "price": "$68.94", "desc": " Choose between 2 Reticles .   3 MOA6 MOA \nBoth durable, machined aluminum housing ensures the unit will stand up to whatever you throw at it. High-quality, fully multi-coated lens offers a clean, wide field of view. Our top-load system makes changing the CR 1632 battery a snap and alleviates the need to remove the sight when switching the power source. The power and dot intensity controls are conveniently located on the left side of the unit. Flush 1 MOA windage and elevation adjustments are super sleek and make sighting in a breeze.\n \n\n\n\n\nOPTICAL FEATURES\n\n\n\nFully Multi-Coated\nMultiple anti-reflective coatings on all air-to-glass surfaces increase light transmission.\n\n\nPremium Wide-Field Lens\nExceptional edge-to-edge resolution.\n\n\nBrightness Settings\nChoose between 10 levels of brightness in manual mode or switch to auto mode.\n\n\nParallax Free\nAll red dot and holographic sights will exhibit some small amount of parallax. Matching current industry practice, this small amount would be considered “parallax free” and will make a negligible difference in the Venom's performance.\n\n\n\n\n\n\n\nCONSTRUCTION FEATURES\n\n\n\nSingle-Piece Chassis\nCompact and lightweight.\n\n\nWaterproof\nO-ring seals prevent moisture, dust and debris from penetrating for reliable performance in all environments.\n\n\nShockproof\nRugged construction withstands recoil and impact.\n\n\nHard Anodized Finish\nHighly durable low-glare matte finish.\n\n\nArmorTek\nUltra-hard, scratch-resistant coating protects exterior lenses from scratches, oil and dirt.\n\n\n\n\n\n\n\nCONVENIENCE FEATURES\n\n\n\nUnlimited Eye Relief\nNon-critical eye relief for rapid target aquisition.\n\n\nBattery Life\n14-hour auto-shutdown feature maximizes battery life. Up to 150 hours of use at highest setting. Use at lower settings can allow up to 30,000 hours.\n\n\n\n\n\n\n\nCOMPATIBILITY FEATURES\n\n\n\nLug/Screw Footprint:\nCompatible with Burris Fastfire/Docter If mounting to a handgun with slide cutout: Slide cutout type\r\n\nGlock MOS (9mm or .40)- Use plate #1 (Call Vortex Customer Care for the correct mounting screws)\nGlock MOS (.45 or 10mm)- Use plate #5 (Call Vortex Customer Care for the correct mounting screws)\nM&P CORE- Plate 5 and the “B” screws\nFNX-45- Uses the non-Trijicon plate       \n\n\n\n\n \nRear sight dovetail mounts:\r\n\nSig P220 series- Mount available at EGWguns.com\n1911s- Mounts available at EGWguns.com\nSpringfield XD/XDM: Mounts available at Springer Precision.\n\n\n\n\n"}, {"itemid": "TS-NEVSURR", "subcat": "We The People Will Never Surrender T-Shirt", "name": "We The People Will Never Surrender T-Shirt", "img": ["wethepeople-front.jpg", "wetehpeople_shirt_back.jpg"], "price": "$103.60", "desc": "    Show your support for the second amendment. Obama is poised to use his unconstitutional executive orders to suppress your right to bear arms, let the world know that We The People will never surrender.  Spread the word and let it be known that when it comes to the second amendment we will stand and fight!"}, {"itemid": "IWL-WINSUN-1", "subcat": "Winter Sun Vitamin D", "name": "Winter Sun Vitamin D", "img": ["wintersun_may2015.jpg", "winter_sun_label.jpg"], "price": "$103.60", "desc": " The new Infowars Life Winter Sun is a premium quality vitamin D3 nutritional supplement that delivers a powerful 2,000 IU per dose.Winter Sun is produced by extracting oil from hearty, nutrient-dense plants known as lichens. Every batch is analyzed to verify purity and D3 content, and to ensure that the formula is free of toxic chemicals, allergens, preservatives, artificial colors, and GMOs.Simply put, this is the highest quality nutraceutical vitamin D3 formulation offered by Infowars Life.Dr. Edward F. Group III, DC, ND explains the creation process of Winter Sun:\n\"Infowars Life Winter Sun is the result of our pursuit for the best source of vitamin D3. Although there are many vitamin D supplements on the market, most are vitamin D2, which we have found is inferior to vitamin D3. This need prompted our journey to create the most powerful, vegan, vitamin D3 product on the market.We located an extremely pure and powerful source of D3, extracted from lichen, and pioneered research to combine it with USP vegetable glycerin to provide 2000IU of D3 per 10 drops.This research and development took over two years but the result, as verified by independent laboratories like Stirling University, is the best, vegan, vitamin D3 product in the world.\"\nWhat are the Health Benefits of Vitamin D?\n\n--Promotes calcium absorption for healthy bones and teeth.\n--Supports the body's natural immune system.\n--Supports natural muscle strength in older adults.\n--Adequate vitamin D is necessary for healthy tissue in systems of the body including the pancreas, breasts, colon, and prostate.\n\nWhy is Winter Sun the Best Vitamin D3 Supplement Available?\n\n--Formulated for easy absorption.\n--Appropriate for vegetarians and vegans.\n--Does not contain any toxins, excipients, or toxic additives.\n--GMO-free.\n"}, {"itemid": "BK-XG-SQ-1", "subcat": "Xenogenesis", "name": "Xenogenesis", "img": ["xenogenesis-book-thumbnail.jpg", "xenogenesis-back-thumbnail.jpg"], "price": "$103.60", "desc": " Monsterous creations are being developed with secret technology in labs around the world. It is a Future of Unimaginable Horrors ...created for our planet by unseen masters. Xenogenesis is the production of an offspring entirely different from either of the parents, transformed though the addition of DNA from an alien or animal to the normal genetics of a human being. The results will be comic book super-heroes come to life, living creatures with mythical abilities unlike anything mankind has seen for thousands of years, and with inspired the ancient legends of gods and goddesses. This horrifying future targets God's original creation for corruption. Evil forces hope to use fallen angel technology to shift the balance of power from God and mankind to Satan and his followers; monsters will soon be presented as our saviours, with hollow promises of eternal life without the need of God or morality. This book offers hope. There is a way to avoid the dangers and ultimately save mankind ...\n"}]